[{"creator":"Tribune News Service","title":"Julius Randle’s return to the All-Star game required a reality check about his attitude","link":"https://www.mercurynews.com/2023/02/02/julius-randles-return-to-the-all-star-game-required-a-reality-check-about-his-attitude/","pubDate":"Fri, 03 Feb 2023 05:41:27 +0000","content:encoded":"<p>Julius Randle finally opened up.</p>\n<p>Perhaps it was the validation of another All-Star selection. Or, maybe it was the confidence immediately after a <a href=\"https://www.nydailynews.com/sports/basketball/knicks/ny-heat-fall-short-in-msg-20230203-dghfmziqineahielxnryunekzi-story.html\" target=\"_blank\" rel=\"noopener\">home victory Thursday over the Miami Heat.</a></p>\n<p>Regardless of the reason, Randle provided the first real explanation of his emotional transformation. From last season&#8217;s petulance to this season&#8217;s resurrection.</p>\n<p>The key moment, Randle revealed, was a visit in the offseason from assistant coach Johnnie Bryant, who got real about the attitude adjustment required from the Knicks top player.</p>\n<p>&#8220;He was talking about the year before and said something like, &#8216;If you were your teammates and saw you acting the way you did sometimes, with body language, showing frustration, would you want to be your teammate?&#8217;&#8221; Randle said. &#8220;And I said, &#8216;No.&#8217; So I had to look myself in the mirror and take accountability and get better and learn from it.&#8221;</p>\n<p>Bryant had made the trip to Dallas for this &#8220;honest&#8221; conversation, which followed an important mental and physical decompression from Randle after his rough 2021-22 campaign. He purposefully didn&#8217;t touch a ball or workout for a couple months.</p>\n<p>&#8220;I was out of shape,&#8221; Randle said. &#8220;He was like, &#8216;Don&#8217;t even worry about it.&#8217; He came and saw me and it was more like big brother, little brother, holding me accountable, talking to me, getting my mind right, more than anything.</p>\n<p>&#8220;He came to me and had an honest conversation. And it helped me put my ego and my pride to the side. And try to adjust my game and look at myself in the mirror and do what&#8217;s best for the team.&#8221;</p>\n<p>The difference is noticeable. The blowups from last season &#8212; whether they were <a href=\"https://www.nydailynews.com/sports/basketball/knicks/ny-julius-randle-referees-tom-thibodeau-20221213-qlr3a54isnby5e2fgtojb73yfa-story.html\" target=\"_blank\" rel=\"noopener\">directed at the referees,</a> the fans, his teammates or the video coordinator &#8212; have diminished significantly. He&#8217;s a full participant in the timeout huddles, which wasn&#8217;t always the case.</p>\n<p>Not coincidentally, Randle&#8217;s production has elevated in almost every statistical category. And as the NBA announced Thursday, <a href=\"https://www.nydailynews.com/sports/basketball/knicks/ny-julius-randle-all-star-20230203-o2xmhgtu5va43klmoirl5hazpu-story.html\" target=\"_blank\" rel=\"noopener\">Randle&#8217;s an All-Star again</a> because he learned to deal better with frustration.</p>\n<p>&#8220;Sometimes I get into my own head because I&#8217;m such a perfectionist with stuff,&#8221; he said. &#8220;And when things aren&#8217;t going right, I can get a little frustrated. For me, I have to accept failure, accept those things, learn to deal with frustration. And I think that is really like the biggest adjustment. Success feels amazing and I don&#8217;t want to let go of it. For me, while we were having our ups and down, I had to learn how to be a leader through success and failure.&#8221;</p>\n<p> ()</p>\n","content:encodedSnippet":"Julius Randle finally opened up.\nPerhaps it was the validation of another All-Star selection. Or, maybe it was the confidence immediately after a home victory Thursday over the Miami Heat.\nRegardless of the reason, Randle provided the first real explanation of his emotional transformation. From last season’s petulance to this season’s resurrection.\nThe key moment, Randle revealed, was a visit in the offseason from assistant coach Johnnie Bryant, who got real about the attitude adjustment required from the Knicks top player.\n“He was talking about the year before and said something like, ‘If you were your teammates and saw you acting the way you did sometimes, with body language, showing frustration, would you want to be your teammate?’” Randle said. “And I said, ‘No.’ So I had to look myself in the mirror and take accountability and get better and learn from it.”\nBryant had made the trip to Dallas for this “honest” conversation, which followed an important mental and physical decompression from Randle after his rough 2021-22 campaign. He purposefully didn’t touch a ball or workout for a couple months.\n“I was out of shape,” Randle said. “He was like, ‘Don’t even worry about it.’ He came and saw me and it was more like big brother, little brother, holding me accountable, talking to me, getting my mind right, more than anything.\n“He came to me and had an honest conversation. And it helped me put my ego and my pride to the side. And try to adjust my game and look at myself in the mirror and do what’s best for the team.”\nThe difference is noticeable. The blowups from last season — whether they were directed at the referees, the fans, his teammates or the video coordinator — have diminished significantly. He’s a full participant in the timeout huddles, which wasn’t always the case.\nNot coincidentally, Randle’s production has elevated in almost every statistical category. And as the NBA announced Thursday, Randle’s an All-Star again because he learned to deal better with frustration.\n“Sometimes I get into my own head because I’m such a perfectionist with stuff,” he said. “And when things aren’t going right, I can get a little frustrated. For me, I have to accept failure, accept those things, learn to deal with frustration. And I think that is really like the biggest adjustment. Success feels amazing and I don’t want to let go of it. For me, while we were having our ups and down, I had to learn how to be a leader through success and failure.”\n ()","dc:creator":"Tribune News Service","comments":"https://www.mercurynews.com/2023/02/02/julius-randles-return-to-the-all-star-game-required-a-reality-check-about-his-attitude/#respond","content":"Julius Randle finally opened up. Or, maybe it was the confidence immediately after a home victory Thursday over the Miami Heat.. The key moment, Randle revealed, was a visit in the offseason from assistant coach Johnnie Bryant, who got real about the attitude adjustment required from the Knicks top player.","contentSnippet":"Julius Randle finally opened up. Or, maybe it was the confidence immediately after a home victory Thursday over the Miami Heat.. The key moment, Randle revealed, was a visit in the offseason from assistant coach Johnnie Bryant, who got real about the attitude adjustment required from the Knicks top player.","guid":"https://www.mercurynews.com/2023/02/02/julius-randles-return-to-the-all-star-game-required-a-reality-check-about-his-attitude/","categories":["NBA","Sports"],"isoDate":"2023-02-03T05:41:27.000Z"},{"creator":"Tribune News Service","title":"Heat come up short 106-104 in wild finish in key seeding battle in New York","link":"https://www.mercurynews.com/2023/02/02/heat-come-up-short-106-104-in-wild-finish-in-key-seeding-battle-in-new-york/","pubDate":"Fri, 03 Feb 2023 04:49:49 +0000","content:encoded":"<p>It was what it hadn&#8217;t been between these teams for a while: Miami Heat vs. New York Knicks with meaning.</p>\n<p>With the Heat entering with a two-game lead over the Knicks for the sixth and final automatic playoff spot in the Eastern Conference, it might not exactly have rekindled memories of Jeff Van Gundy hanging on Alonzo Mourning&#8217;s leg, or P.J. Brown turning Charlie Ward into a ragdoll during Pat Riley&#8217;s Heat coaching heyday, but the implications were real.</p>\n<p>And ultimately painful for the Heat in their 106-104 loss Thursday night at Madison Square Garden,</p>\n<p>&#8220;We put ourselves in position,&#8221; coach Erik Spoelstra said.</p>\n<p>That the Heat did, falling short when guard Tyler Herro was off on a 3-point attempt with five-tenths of a second to play.</p>\n<p>&#8220;I thought it was a good look,&#8221; Herro said.</p>\n<p>In falling in the first of the teams&#8217; four meetings this season, the Heat dropped to 1-2 on this four-game trip that concludes with an even tougher test Saturday night against the Milwaukee Bucks.</p>\n<p>Even with the Knicks lacking guard Jalen Brunson, who called in sick, the Heat were unable to muster enough to offset 30 points from R,J. Barrett and 23 from Julius Randle.</p>\n<p>The Heat got 32 points from Bam Adebayo and 25 from Herro, but only 10 from Jimmy Butler, who shot 5 of 13. The Heat also got 17 points from Max Strus.</p>\n<p>Adebayo was named an All-Star a half hour before tipoff.</p>\n<p>&#8220;It&#8217;s good to be back in the All-Star Game, but I&#8217;m kind of bummed,&#8221; Adebayo said of the night ending with a loss.</p>\n<p>Five Degrees of Heat from Thursday&#8217;s game:</p>\n<p><b>1. Closing time: </b>The Heat fell behind by 13 early before closing within 28-22 at the end of the first quarter, then down 51-48 at halftime.</p>\n<p>A wild third period opened with an 11-0 New York run, before the Heat stormed back with a 19-2 surge, only to see the Knicks take a 77-72 lead into the fourth.</p>\n<p>The Knicks then led to 11, before Butler returned with 7:12 to play. A 10-2 run sparked by Herro then drew the Heat within 94-91 with 3:40 left.</p>\n<p>A pivotal moment then came with 1:22 to play, with a layup by Barrett ruled good upon replay of a goaltend call on the Heat, putting New York up 102-97. A Herro basket followed to bring the Heat within 102-99 with 1:11 left.</p>\n<p>From there, Adebayo came up with a steal and converted both free throws to bring the Heat within 102-101 with 52.8 left.</p>\n<p>A wild sequence that featured a dunk by the Knicks&#8217; Isaiah Hartenstein and a Hartenstein steal followed, putting the Knicks up 106-101 with 5.2 seconds left, with a Strus 3-pointer making it 106-104 with 2.9 seconds left.</p>\n<p>With 2.1 seconds left, the Heat won a challenge of a foul called on Adebayo, putting them in possession with 2.1 seconds to play down two.</p>\n<p>The Heat then used their final timeout to advance the ball to midcourt, the game ending when Herro was off on his open corner 3-point attempt.</p>\n<p>&#8220;That&#8217;s the DNA of our group,&#8221; Spoelstra said. &#8220;We&#8217;re going to fight, for sure.&#8221;</p>\n<p><b>2. Attack mode: </b>For all the success with his feathery lane jumper this season, Adebayo said earlier this week that he also wanted to play with the type of aggression that would get him to the foul line.</p>\n<p>He did just that with a blow-by dunk in the second period that punished the too-late help of long-time Heat nemesis Evan Fournier.</p>\n<p>Adebayo then got back to his jumper game to keep the Heat competitive to the finish.</p>\n<p>He closed 10 of 11 from the line, with the rest of the roster 3 of 5.</p>\n<p>&#8220;We&#8217;re just a better basketball team offensively when Bam and Jimmy are attacking,&#8221; Spoelstra said, with Butler missing his lone free-throw attempt.</p>\n<p>&#8220;Bam was able to do that tonight.&#8221;</p>\n<p><b>3. A Strus revival:</b> Uneven this season, Strus this time was 3 of 4 on 3-pointers in the first half, with the rest of the roster 2 of 11 over the opening two periods.</p>\n<p>With Victor Oladipo out with an ankle sprain, Strus played as the Heat&#8217;s first wing off the bench.</p>\n<p>&#8220;When we find Max in rhythm,&#8221; Spoelstra said, &#8220;he&#8217;s a great shooter, and the numbers still support that.&#8221;</p>\n<p>Strus closed 5 of 9 from the field, including 5 of 8 on 3-pointers.</p>\n<p>It was such a mix-and-match night for Spoelstra that the Heat closed the third period with a lineup of Udonis Haslem, Haywood Highsmith, Gabe Vincent, Strus and Herro.</p>\n<p>Highsmith had not appeared in the previous two games.</p>\n<p>&#8220;He&#8217;s the next guy,&#8221; Spoelstra said of Highsmith. &#8220;Vic was out. There&#8217;s no hesitation with that.&#8221;</p>\n<p><b>4. Dedmon bypassed:</b> With undrafted rookie Orlando Robinson out with the thumb fracture sustained in the third quarter of Tuesday night&#8217;s victory in Cleveland, 42-year-old captain Haslem played as reserve center ahead of Dewayne Dedmon.</p>\n<p>It was Haslem&#8217;s first appearance since Dec. 15 against the Houston Rockets, and just his sixth game of the season, having played 37 total minutes entering Thursday.</p>\n<p>&#8220;I actually intended on playing both of them tonight,&#8221; Spoelstra said of Haslem and Dedmon, &#8220;but since it was Heat and Knicks, it was just very fitting that I played UD. And he gave us some good minutes.&#8221;</p>\n<p>In a turn-back-the-clock moment, Haslem&#8217;s initial stint included drawing a charge, with the Heat in their throwback uniforms. He closed scoreless on 0-for-2 shooting with two rebounds in his 10:23.</p>\n<p>&#8220;When your name is called, you&#8217;ve got to step up,&#8221; Haslem said. &#8220;It&#8217;s small minutes, but you never know what impact you can have on the game.&#8221;</p>\n<p>Dedmon has not played since he was suspended one game by the Heat for conduct detrimental to the team after words with Spoelstra during the Jan. 10 home victory over the Oklahoma City Thunder.</p>\n<p><b>5. Oladipo out:</b> With Oladipo out due to an ankle sprain sustained against the Cavaliers, Strus played as the Heat&#8217;s first wing off the bench.</p>\n<p>Spoelstra said Oladipo&#8217;s ankle became more of a concern in the wake of Tuesday night&#8217;s victory in Cleveland.</p>\n<p>&#8220;He was able to finish the game, but it&#8217;s a sprained ankle,&#8221; Spoelstra said. &#8220;Once you fly and wake up the next day, sometimes it can swell up on you. We&#8217;ll manage it.&#8221;</p>\n<p>Oladipo was ruled out midafternoon.</p>\n<p>&#8220;We&#8217;ll just evaluate him day to day,&#8221; Spoelstra said.</p>\n<p>Oladipo has struggled in recent games, including five points on 2-of-9 shooting Tuesday in Cleveland.</p>\n<p> ()</p>\n","content:encodedSnippet":"It was what it hadn’t been between these teams for a while: Miami Heat vs. New York Knicks with meaning.\nWith the Heat entering with a two-game lead over the Knicks for the sixth and final automatic playoff spot in the Eastern Conference, it might not exactly have rekindled memories of Jeff Van Gundy hanging on Alonzo Mourning’s leg, or P.J. Brown turning Charlie Ward into a ragdoll during Pat Riley’s Heat coaching heyday, but the implications were real.\nAnd ultimately painful for the Heat in their 106-104 loss Thursday night at Madison Square Garden,\n“We put ourselves in position,” coach Erik Spoelstra said.\nThat the Heat did, falling short when guard Tyler Herro was off on a 3-point attempt with five-tenths of a second to play.\n“I thought it was a good look,” Herro said.\nIn falling in the first of the teams’ four meetings this season, the Heat dropped to 1-2 on this four-game trip that concludes with an even tougher test Saturday night against the Milwaukee Bucks.\nEven with the Knicks lacking guard Jalen Brunson, who called in sick, the Heat were unable to muster enough to offset 30 points from R,J. Barrett and 23 from Julius Randle.\nThe Heat got 32 points from Bam Adebayo and 25 from Herro, but only 10 from Jimmy Butler, who shot 5 of 13. The Heat also got 17 points from Max Strus.\nAdebayo was named an All-Star a half hour before tipoff.\n“It’s good to be back in the All-Star Game, but I’m kind of bummed,” Adebayo said of the night ending with a loss.\nFive Degrees of Heat from Thursday’s game:\n1. Closing time: The Heat fell behind by 13 early before closing within 28-22 at the end of the first quarter, then down 51-48 at halftime.\nA wild third period opened with an 11-0 New York run, before the Heat stormed back with a 19-2 surge, only to see the Knicks take a 77-72 lead into the fourth.\nThe Knicks then led to 11, before Butler returned with 7:12 to play. A 10-2 run sparked by Herro then drew the Heat within 94-91 with 3:40 left.\nA pivotal moment then came with 1:22 to play, with a layup by Barrett ruled good upon replay of a goaltend call on the Heat, putting New York up 102-97. A Herro basket followed to bring the Heat within 102-99 with 1:11 left.\nFrom there, Adebayo came up with a steal and converted both free throws to bring the Heat within 102-101 with 52.8 left.\nA wild sequence that featured a dunk by the Knicks’ Isaiah Hartenstein and a Hartenstein steal followed, putting the Knicks up 106-101 with 5.2 seconds left, with a Strus 3-pointer making it 106-104 with 2.9 seconds left.\nWith 2.1 seconds left, the Heat won a challenge of a foul called on Adebayo, putting them in possession with 2.1 seconds to play down two.\nThe Heat then used their final timeout to advance the ball to midcourt, the game ending when Herro was off on his open corner 3-point attempt.\n“That’s the DNA of our group,” Spoelstra said. “We’re going to fight, for sure.”\n2. Attack mode: For all the success with his feathery lane jumper this season, Adebayo said earlier this week that he also wanted to play with the type of aggression that would get him to the foul line.\nHe did just that with a blow-by dunk in the second period that punished the too-late help of long-time Heat nemesis Evan Fournier.\nAdebayo then got back to his jumper game to keep the Heat competitive to the finish.\nHe closed 10 of 11 from the line, with the rest of the roster 3 of 5.\n“We’re just a better basketball team offensively when Bam and Jimmy are attacking,” Spoelstra said, with Butler missing his lone free-throw attempt.\n“Bam was able to do that tonight.”\n3. A Strus revival: Uneven this season, Strus this time was 3 of 4 on 3-pointers in the first half, with the rest of the roster 2 of 11 over the opening two periods.\nWith Victor Oladipo out with an ankle sprain, Strus played as the Heat’s first wing off the bench.\n“When we find Max in rhythm,” Spoelstra said, “he’s a great shooter, and the numbers still support that.”\nStrus closed 5 of 9 from the field, including 5 of 8 on 3-pointers.\nIt was such a mix-and-match night for Spoelstra that the Heat closed the third period with a lineup of Udonis Haslem, Haywood Highsmith, Gabe Vincent, Strus and Herro.\nHighsmith had not appeared in the previous two games.\n“He’s the next guy,” Spoelstra said of Highsmith. “Vic was out. There’s no hesitation with that.”\n4. Dedmon bypassed: With undrafted rookie Orlando Robinson out with the thumb fracture sustained in the third quarter of Tuesday night’s victory in Cleveland, 42-year-old captain Haslem played as reserve center ahead of Dewayne Dedmon.\nIt was Haslem’s first appearance since Dec. 15 against the Houston Rockets, and just his sixth game of the season, having played 37 total minutes entering Thursday.\n“I actually intended on playing both of them tonight,” Spoelstra said of Haslem and Dedmon, “but since it was Heat and Knicks, it was just very fitting that I played UD. And he gave us some good minutes.”\nIn a turn-back-the-clock moment, Haslem’s initial stint included drawing a charge, with the Heat in their throwback uniforms. He closed scoreless on 0-for-2 shooting with two rebounds in his 10:23.\n“When your name is called, you’ve got to step up,” Haslem said. “It’s small minutes, but you never know what impact you can have on the game.”\nDedmon has not played since he was suspended one game by the Heat for conduct detrimental to the team after words with Spoelstra during the Jan. 10 home victory over the Oklahoma City Thunder.\n5. Oladipo out: With Oladipo out due to an ankle sprain sustained against the Cavaliers, Strus played as the Heat’s first wing off the bench.\nSpoelstra said Oladipo’s ankle became more of a concern in the wake of Tuesday night’s victory in Cleveland.\n“He was able to finish the game, but it’s a sprained ankle,” Spoelstra said. “Once you fly and wake up the next day, sometimes it can swell up on you. We’ll manage it.”\nOladipo was ruled out midafternoon.\n“We’ll just evaluate him day to day,” Spoelstra said.\nOladipo has struggled in recent games, including five points on 2-of-9 shooting Tuesday in Cleveland.\n ()","dc:creator":"Tribune News Service","comments":"https://www.mercurynews.com/2023/02/02/heat-come-up-short-106-104-in-wild-finish-in-key-seeding-battle-in-new-york/#respond","content":"It was what it hadn&#8217; t been between these teams for a while: Miami Heat vs. New York Knicks with meaning. With the Heat entering with a two-game lead over the Knicks for the sixth and final automatic playoff spot in the Eastern Conference, it might not exactly have rekindled memories of Jeff Van Gundy hanging on Alonzo Mourning&#8217; s leg, or P.J. Brown turning Charlie Ward...","contentSnippet":"It was what it hadn’ t been between these teams for a while: Miami Heat vs. New York Knicks with meaning. With the Heat entering with a two-game lead over the Knicks for the sixth and final automatic playoff spot in the Eastern Conference, it might not exactly have rekindled memories of Jeff Van Gundy hanging on Alonzo Mourning’ s leg, or P.J. Brown turning Charlie Ward...","guid":"https://www.mercurynews.com/2023/02/02/heat-come-up-short-106-104-in-wild-finish-in-key-seeding-battle-in-new-york/","categories":["NBA","Sports"],"isoDate":"2023-02-03T04:49:49.000Z"},{"creator":"Madeline Kenney","title":"Warriors collapse in third quarter to drop second straight game","link":"https://www.mercurynews.com/2023/02/02/warriors-collapse-in-third-quarter-to-drop-second-straight-game/","pubDate":"Fri, 03 Feb 2023 04:32:31 +0000","content:encoded":"<p>DENVER &#8212; Without their defensive ace Draymond Green, the Warriors on Thursday struggled to contain two-time reigning MVP Nikola Jokic. </p>\n<p>The Nuggets star finished with his 18th triple-double of the season en route to sending Golden State back to the Bay with a 134-117 loss. </p>\n<p>The game flipped in favor of the Nuggets in the second half. Golden State trailed by only one at the break, but were outscored 35-22 in a sloppy third quarter, during which the Warriors committed eight of their 17 turnovers.</p>\n<p>Golden State, who was also without Klay Thompson, entered the final quarter in a 14-point hole and couldn&#8217;t come back. </p>\n<p>Jokic finished with 22 points, 16 assists and 14 points in 33 minutes.</p>\n<p>Stephen Curry had 18 points with five 3s, Jordan Poole added 22 and Jonathan Kuminga recorded 17 points and seven rebounds, but the top team in the West controlled the game for the second half.</p>\n<p>Green and Curry were listed as questionable in the hours before the game but coach Steve Kerr said he anticipated them both to be available for the game. Curry got the green light to start but Green was a late scratch after he experienced tightness in his right calf after warmups. </p>\n<p>Green&#8217;s absence paved the way for James Wiseman to finally break out of bench purgatory. He made his first appearance in a game since Dec. 28, starting the second quarter and playing the end of the third and most of the fourth. He looked a step behind at times, which is to be expected after missing such a significant amount of time. In the second quarter, Green pulled Wiseman aside and appeared to emphatically coach up the young center who&#8217;s struggled to earn a spot in the rotation. </p>\n<p>Wiseman finished with nine points on 3-of-4 shooting and grabbed two rebounds in 17 minutes. </p>\n<p>The Warriors opened the game going 13-for-21 from deep before finishing the night 19-for-38. But their hot shooting from 3-point range wasn&#8217;t enough. </p>\n<p>The Warriors went 1-2 on this road trip and fell back down to .500. They will return home to host the Dallas Mavericks on Sunday.</p>\n","content:encodedSnippet":"DENVER — Without their defensive ace Draymond Green, the Warriors on Thursday struggled to contain two-time reigning MVP Nikola Jokic. \nThe Nuggets star finished with his 18th triple-double of the season en route to sending Golden State back to the Bay with a 134-117 loss. \nThe game flipped in favor of the Nuggets in the second half. Golden State trailed by only one at the break, but were outscored 35-22 in a sloppy third quarter, during which the Warriors committed eight of their 17 turnovers.\nGolden State, who was also without Klay Thompson, entered the final quarter in a 14-point hole and couldn’t come back. \nJokic finished with 22 points, 16 assists and 14 points in 33 minutes.\nStephen Curry had 18 points with five 3s, Jordan Poole added 22 and Jonathan Kuminga recorded 17 points and seven rebounds, but the top team in the West controlled the game for the second half.\nGreen and Curry were listed as questionable in the hours before the game but coach Steve Kerr said he anticipated them both to be available for the game. Curry got the green light to start but Green was a late scratch after he experienced tightness in his right calf after warmups. \nGreen’s absence paved the way for James Wiseman to finally break out of bench purgatory. He made his first appearance in a game since Dec. 28, starting the second quarter and playing the end of the third and most of the fourth. He looked a step behind at times, which is to be expected after missing such a significant amount of time. In the second quarter, Green pulled Wiseman aside and appeared to emphatically coach up the young center who’s struggled to earn a spot in the rotation. \nWiseman finished with nine points on 3-of-4 shooting and grabbed two rebounds in 17 minutes. \nThe Warriors opened the game going 13-for-21 from deep before finishing the night 19-for-38. But their hot shooting from 3-point range wasn’t enough. \nThe Warriors went 1-2 on this road trip and fell back down to .500. They will return home to host the Dallas Mavericks on Sunday.","dc:creator":"Madeline Kenney","comments":"https://www.mercurynews.com/2023/02/02/warriors-collapse-in-third-quarter-to-drop-second-straight-game/#respond","content":"The Warriors on Thursday struggled to contain two-time reigning MVP Nikola Jokic. ","contentSnippet":"The Warriors on Thursday struggled to contain two-time reigning MVP Nikola Jokic.","guid":"https://www.mercurynews.com/?p=9731502","categories":["Golden State Warriors","Latest Headlines","NBA","Sports","Basketball","Inside Sports","Warriors HQ"],"isoDate":"2023-02-03T04:32:31.000Z"},{"creator":"Tribune News Service","title":"Knicks escape with a 106-104 victory against surging Heat without Jalen Brunson","link":"https://www.mercurynews.com/2023/02/02/knicks-escape-with-a-106-104-victory-against-surging-heat-without-jalen-brunson/","pubDate":"Fri, 03 Feb 2023 04:32:20 +0000","content:encoded":"<p>Not even facial recognition could see that coming.</p>\n<p>Without an ill and inactive Jalen Brunson, the Knicks held off the surging Miami Heat despite bumbling and stumbling through the final minute of a 106-104 victory at MSG.</p>\n<p>It ended with a potential game-winner from Miami&#8217;s Tyler Herro bouncing off the rim, allowing Julius Randle to breathe easy after his turnover nearly squandered the game.</p>\n<p>The final moments were absolutely wild. It included two awful passes and turnovers from RJ Barrett &#8212; who was otherwise brilliant Thursday &#8212; and a stumble from Randle with 2.1 seconds that was reviewed by the officials as a travel.</p>\n<p>But the Knicks (28-25) prevailed, moving a game within the Heat (29-24) for sixth in the Eastern Conference. They got a clutch steal and dunk from Isaiah Hartenstein, who has played better in the last two games with Mitchell Robinson still out with a broken thumb.</p>\n<p>&#8220;We needed that,&#8221; Randle said. &#8220;Especially at home. We haven&#8217;t played as well as we wanted to here.&#8221;</p>\n<p>Barrett finished with 30 points in 41 minutes, playing down the stretch this time after <a href=\"https://www.nydailynews.com/sports/basketball/knicks/ny-rj-barrett-benched-lakers-overtime-20230201-mdpkkxh76feahe4qytyyize6a4-story.html\" target=\"_blank\" rel=\"noopener\">being benched in the important moments of Tuesday&#8217;s loss to the Lakers.</a> It was something of a redemption moment for the 22-year-old, who essentially served as the ball handler without Brunson.</p>\n<p>&#8220;I&#8217;m talking to you guys today,&#8221; Barrett joked after he declined to talk to the media following Tuesday&#8217;s benching. &#8220;I&#8217;m human I get frustrated sometimes. My mother told me if you don&#8217;t have anything nice to say, don&#8217;t say anything at all.&#8221;</p>\n<p>There were plenty of nice things to say about Barrett against the Heat, the two late turnovers notwithstanding.</p>\n<p>&#8220;Just shows his growth,&#8221; Randle said about Barrett. &#8220;You can pout and kind of sulk because you didn&#8217;t play in the game before. But everyone here is all-in on winning. And for him to come in and constantly make the right plays was big. So I&#8217;m super proud of him.&#8221;</p>\n<p>Randle, who was named an All-Star reserve not long before tipoff, added 23 points and 10 rebounds, including a dunk with 5.2 seconds remaining.</p>\n<p>The Heat are one of the hottest teams in the Eastern Conference, recovering from a poor start to the season to climb into a playoff spot. Miami also beat the Knicks nine times in its last 11 matchups.</p>\n<p>But not Thursday.</p>\n<p>Brunson was a late scratch with a non-COVID illness, moving Immanuel Quickley into the starting lineup. It represented Brunson&#8217;s fourth missed game of the season, and the Knicks are now 2-2 without their starting point guard.</p>\n<p>His DNP Thursday also pushed Evan Fournier back into the rotation, as the Frenchman logged 18 minutes and missed six of his seven shots. Quickley added eight points in 37 minutes.</p>\n<p>Bam Adebayo, who was named an All-Star reserve alongside Randle, led the Heat with 32 points in 38 minutes.</p>\n<p>The third quarter, like the end of the game, was a rollercoaster. The Knicks started with 11 straight points to take a commanding lead, the Heat followed with a 21-4 run, and the Knicks scored 11 of the final 14 points. In the end, the Knicks entered the final period with a five-point edge.</p>\n<p>Coach Tom Thibodeau knew it would be a tough matchup and the Knicks squeaked by.</p>\n<p> ()</p>\n","content:encodedSnippet":"Not even facial recognition could see that coming.\nWithout an ill and inactive Jalen Brunson, the Knicks held off the surging Miami Heat despite bumbling and stumbling through the final minute of a 106-104 victory at MSG.\nIt ended with a potential game-winner from Miami’s Tyler Herro bouncing off the rim, allowing Julius Randle to breathe easy after his turnover nearly squandered the game.\nThe final moments were absolutely wild. It included two awful passes and turnovers from RJ Barrett — who was otherwise brilliant Thursday — and a stumble from Randle with 2.1 seconds that was reviewed by the officials as a travel.\nBut the Knicks (28-25) prevailed, moving a game within the Heat (29-24) for sixth in the Eastern Conference. They got a clutch steal and dunk from Isaiah Hartenstein, who has played better in the last two games with Mitchell Robinson still out with a broken thumb.\n“We needed that,” Randle said. “Especially at home. We haven’t played as well as we wanted to here.”\nBarrett finished with 30 points in 41 minutes, playing down the stretch this time after being benched in the important moments of Tuesday’s loss to the Lakers. It was something of a redemption moment for the 22-year-old, who essentially served as the ball handler without Brunson.\n“I’m talking to you guys today,” Barrett joked after he declined to talk to the media following Tuesday’s benching. “I’m human I get frustrated sometimes. My mother told me if you don’t have anything nice to say, don’t say anything at all.”\nThere were plenty of nice things to say about Barrett against the Heat, the two late turnovers notwithstanding.\n“Just shows his growth,” Randle said about Barrett. “You can pout and kind of sulk because you didn’t play in the game before. But everyone here is all-in on winning. And for him to come in and constantly make the right plays was big. So I’m super proud of him.”\nRandle, who was named an All-Star reserve not long before tipoff, added 23 points and 10 rebounds, including a dunk with 5.2 seconds remaining.\nThe Heat are one of the hottest teams in the Eastern Conference, recovering from a poor start to the season to climb into a playoff spot. Miami also beat the Knicks nine times in its last 11 matchups.\nBut not Thursday.\nBrunson was a late scratch with a non-COVID illness, moving Immanuel Quickley into the starting lineup. It represented Brunson’s fourth missed game of the season, and the Knicks are now 2-2 without their starting point guard.\nHis DNP Thursday also pushed Evan Fournier back into the rotation, as the Frenchman logged 18 minutes and missed six of his seven shots. Quickley added eight points in 37 minutes.\nBam Adebayo, who was named an All-Star reserve alongside Randle, led the Heat with 32 points in 38 minutes.\nThe third quarter, like the end of the game, was a rollercoaster. The Knicks started with 11 straight points to take a commanding lead, the Heat followed with a 21-4 run, and the Knicks scored 11 of the final 14 points. In the end, the Knicks entered the final period with a five-point edge.\nCoach Tom Thibodeau knew it would be a tough matchup and the Knicks squeaked by.\n ()","dc:creator":"Tribune News Service","comments":"https://www.mercurynews.com/2023/02/02/knicks-escape-with-a-106-104-victory-against-surging-heat-without-jalen-brunson/#respond","content":"Without an ill and inactive Jalen Brunson, the Knicks held off the surging Miami Heat despite bumbling and stumbling through the final minute of a 106-104 victory at MSG. It ended with a potential game-winner from Miami&#8217; s Tyler Herro bouncing off the rim, allowing Julius Randle to breathe easy after his turnover nearly squandered the game.","contentSnippet":"Without an ill and inactive Jalen Brunson, the Knicks held off the surging Miami Heat despite bumbling and stumbling through the final minute of a 106-104 victory at MSG. It ended with a potential game-winner from Miami’ s Tyler Herro bouncing off the rim, allowing Julius Randle to breathe easy after his turnover nearly squandered the game.","guid":"https://www.mercurynews.com/2023/02/02/knicks-escape-with-a-106-104-victory-against-surging-heat-without-jalen-brunson/","categories":["NBA","Sports"],"isoDate":"2023-02-03T04:32:20.000Z"},{"creator":"Tribune News Service","title":"Bengals running back Joe Mixon accused of threatening woman at gunpoint","link":"https://www.mercurynews.com/2023/02/02/bengals-running-back-joe-mixon-accused-of-threatening-woman-at-gunpoint/","pubDate":"Fri, 03 Feb 2023 04:15:12 +0000","content:encoded":"<p>Cincinnati Bengals running back Joe Mixon was accused of holding a woman at gunpoint and threatening to shoot her last month.</p>\n<p>A warrant was issued Thursday for Mixon&#8217;s arrest.</p>\n<p>Police said Mixon pulled a gun on the woman in downtown Cincinnati on Jan. 21 and told her, &#8220;You should be popped in the face. I should shoot you, the police [can&#8217;t] get me,&#8221; according to the warrant obtained by <a href=\"https://twitter.com/EvanMillward/status/1621293451592474625\" target=\"_blank\" rel=\"noopener\">local ABC affiliate WCPO</a>.</p>\n<p>The incident occurred one day before the Bengals played the Buffalo Bills in the NFL playoffs. Cincinnati won that game but was eliminated last Sunday by the Kansas City Chiefs in the AFC title game.</p>\n<p>Mixon, 26, was charged with one count of aggravated menacing, a first-degree misdemeanor. His agent claimed the charge would be dropped Friday morning, according to NFL Network.</p>\n<p>&#8220;It was a rush to judgment. They&#8217;re dropping the charges first thing in the morning,&#8221; agent Peter Schaffter <a href=\"https://twitter.com/TomPelissero/status/1621314910339698688\" target=\"_blank\" rel=\"noopener\">told reporter Tom Pelissero</a>.</p>\n<p>In 2014, Mixon was caught on camera punching a woman in the face at a restaurant. The woman was a student at the University of Oklahoma at the time, as was Mixon.</p>\n<p>Mixon made an Alford plea in the case, in which a defendant does not admit guilt but acknowledges there is sufficient evidence for a conviction. He received a deferred sentence and community service.</p>\n<p><b>With News Wire Services</b></p>\n<p> ()</p>\n","content:encodedSnippet":"Cincinnati Bengals running back Joe Mixon was accused of holding a woman at gunpoint and threatening to shoot her last month.\nA warrant was issued Thursday for Mixon’s arrest.\nPolice said Mixon pulled a gun on the woman in downtown Cincinnati on Jan. 21 and told her, “You should be popped in the face. I should shoot you, the police [can’t] get me,” according to the warrant obtained by local ABC affiliate WCPO.\nThe incident occurred one day before the Bengals played the Buffalo Bills in the NFL playoffs. Cincinnati won that game but was eliminated last Sunday by the Kansas City Chiefs in the AFC title game.\nMixon, 26, was charged with one count of aggravated menacing, a first-degree misdemeanor. His agent claimed the charge would be dropped Friday morning, according to NFL Network.\n“It was a rush to judgment. They’re dropping the charges first thing in the morning,” agent Peter Schaffter told reporter Tom Pelissero.\nIn 2014, Mixon was caught on camera punching a woman in the face at a restaurant. The woman was a student at the University of Oklahoma at the time, as was Mixon.\nMixon made an Alford plea in the case, in which a defendant does not admit guilt but acknowledges there is sufficient evidence for a conviction. He received a deferred sentence and community service.\nWith News Wire Services\n ()","dc:creator":"Tribune News Service","comments":"https://www.mercurynews.com/2023/02/02/bengals-running-back-joe-mixon-accused-of-threatening-woman-at-gunpoint/#respond","content":"Cincinnati Bengals running back Joe Mixon was accused of holding a woman at gunpoint and threatening to shoot her last month. Police said Mixon pulled a gun on the woman in downtown Cincinnati on Jan. 21 and told her,&#8220; You should be popped in the face. I should shoot you, the police get me,&#8221; according to the warrant obtained by local ABC affiliate WCPO.","contentSnippet":"Cincinnati Bengals running back Joe Mixon was accused of holding a woman at gunpoint and threatening to shoot her last month. Police said Mixon pulled a gun on the woman in downtown Cincinnati on Jan. 21 and told her,“ You should be popped in the face. I should shoot you, the police get me,” according to the warrant obtained by local ABC affiliate WCPO.","guid":"https://www.mercurynews.com/2023/02/02/bengals-running-back-joe-mixon-accused-of-threatening-woman-at-gunpoint/","categories":["NFL","Sports"],"isoDate":"2023-02-03T04:15:12.000Z"},{"creator":"Doug Ferguson","title":"AT&T Pebble Beach Pro-Am: From low scores to ‘bizarre’ conditions in opening round","link":"https://www.mercurynews.com/2023/02/02/att-pebble-beach-pro-am-from-low-scores-to-bizarre-conditions-in-opening-round/","pubDate":"Fri, 03 Feb 2023 04:03:24 +0000","content:encoded":"<p>PEBBLE BEACH &#8212; Changes in weather and fortunes can happen without notice in the AT&amp;T Pebble Beach Pro-Am, which seems to suit Hank Lebioda just fine these days.</p>\n<p>Playing his sixth different course in his last six rounds on the PGA Tour, Lebioda ran off six birdies in an eight-hole stretch for an 8-under 63 on the Shore course at Monterey Peninsula and a one-shot lead after the opening round Thursday.</p>\n<p>His big advantage was finishing before a pleasant day of mostly sunny, relatively calm conditions gave way to wind strong enough to bend flagsticks and force players to remove caps before they putted so they wouldn’t blow off.</p>\n<p>Lebioda was among six players from the leading 12 scores who have yet to win on the PGA Tour. He doesn’t have a good recipe for success in tournaments with multiple courses except to be prepared for anything.</p>\n<p>“This would be eight courses in three weeks for us,” said Lebioda, who missed the cut in the Farmers Insurance Open at Torrey Pines and The American Express. “Three courses in Palm Springs, two last week in San Diego, and three this week. So the best thing you can do is take care of yourself, relax, and make sure you’re good to go.”</p>\n<p>Three of the top four scores to par were at Monterey Peninsula. Kurt Kitayama made four straight birdies around the turn and had a bogey-free 64, while Harry Hall made five straight birdies and was tied for the lead until a late bogey on No. 8. He also had 64.</p>\n<p>“The birdie streak on the front was pretty cool because I think I went bogey and then had a par on the second hole and then had five in a row. So it was really good,” Hall said. “Coming down the last two holes it started to blow 45 miles an hour. It was crazy. Happy to get in at 7 under today.”</p>\n<p>Chad Ramey had a 7-under 65 at Pebble Beach. He was tied for the lead until going into the front bunker on the par-3 17th and taking bogey.</p>\n<p>The best score at Spyglass Hill belonged to Keith Mitchell at 5-under 67. It was the only course where the average score was over par. Mitchell was alongside a pair of NFL quarterbacks. His amateur partner is Josh Allen of the Buffalo Bills, whose caddie for the week is Kyle Allen of the Houston Texans.</p>\n<p>The change in weather was not terribly severe — it’s not like it snowed. Even so, it caused havoc among those trying to finish at Pebble Beach, the most exposed of the courses.</p>\n<p>Will Gordon was tied for the lead to par at 8 under with three holes to play. From the middle of the 16th fairway into a strengthening wind, he came up 35 yards short of the back pin and made bogey. Dead into the wind on the par-3 17th to a right pin — the easiest location for three days to account for amateurs — he was some 30 yards short and dropped another shot.</p>\n<p>He finished with a triple bogey, driving into the ocean rocks left of the fairway and having to reload. His approach into a strong wind coming off the ocean left him behind a tree, and he hit that over the green into a bunker.</p>\n<p>In three holes, he went from tied for the lead to a tie for 24th.</p>\n<p>The celebrity rotation was at Spyglass Hill, regarded as the toughest of the three in calm conditions. U.S Open champion Matt Fitzpatrick and three-time major champion Jordan Spieth each managed a 71, while Viktor Hovland had a 70.</p>\n<p>Hovland is playing the tournament for the first time, though he won the U.S. Amateur at Pebble Beach and was low amateur at Pebble in the 2019 U.S. Open.</p>\n<p>Spieth, who won this event in 2017, was mixture of birdies and bogeys, and then had to hang on for dear life over the final hour when temperatures plunged and the wind began whipping.</p>\n<aside class=\"related left\"><h2 class=\"widget-title\" data-curated-ids=\"\" data-relation-type=\"automatic-primary-section\">Related Articles</h2><ul><li>\n\n<div class=\"entry-section\"><a href=\"https://www.mercurynews.com/sports/golf/\">Golf | </a></div>\t\t\t<a class=\"article-title\" href=\"https://www.mercurynews.com/2023/02/02/prepping-for-the-pebble-beach-pro-am-glimpse-of-the-action-2/\" title=\"Photos: Prepping for the Pebble Beach Pro-Am\">\n\t\n\t\t\t\t<span class=\"dfm-title metered\">\n\t\t\tPhotos: Prepping for the Pebble Beach Pro-Am\t\t</span>\n\n\t\t\t</a>\n\t\n</li><li>\n\n<div class=\"entry-section\"><a href=\"https://www.mercurynews.com/sports/golf/\">Golf | </a></div>\t\t\t<a class=\"article-title\" href=\"https://www.mercurynews.com/2023/01/27/att-pebble-beach-pro-am-7-foot-pau-gasol-joins-celebrity-lineup/\" title=\"AT&amp;T Pebble Beach Pro-Am: 7-foot Pau Gasol joins celebrity lineup\">\n\t\n\t\t\t\t<span class=\"dfm-title metered\">\n\t\t\tAT&amp;T Pebble Beach Pro-Am: 7-foot Pau Gasol joins celebrity lineup\t\t</span>\n\n\t\t\t</a>\n\t\n</li><li>\n\n<div class=\"entry-section\"><a href=\"https://www.mercurynews.com/sports/golf/\">Golf | </a></div>\t\t\t<a class=\"article-title\" href=\"https://www.mercurynews.com/2023/01/25/alameda-wants-a-mulligan-on-lawsuit-against-operators-of-its-prestigious-bay-area-golf-course/\" title=\"Alameda wants a mulligan on lawsuit against operators of its prestigious Bay Area golf course\">\n\t\n\t\t\t\t<span class=\"dfm-title metered\">\n\t\t\tAlameda wants a mulligan on lawsuit against operators of its prestigious Bay Area golf course\t\t</span>\n\n\t\t\t</a>\n\t\n</li><li>\n\n<div class=\"entry-section\"><a href=\"https://www.mercurynews.com/sports/golf/\">Golf | </a></div>\t\t\t<a class=\"article-title\" href=\"https://www.mercurynews.com/2023/01/18/bill-murray-will-return-for-this-years-att-pebble-beach-pro-am/\" title=\"Bill Murray will return for this year’s AT&amp;T Pebble Beach Pro-Am\">\n\t\n\t\t\t\t<span class=\"dfm-title metered\">\n\t\t\tBill Murray will return for this year’s AT&amp;T Pebble Beach Pro-Am\t\t</span>\n\n\t\t\t</a>\n\t\n</li><li>\n\n<div class=\"entry-section\"><a href=\"https://www.mercurynews.com/sports/golf/\">Golf | </a></div>\t\t\t<a class=\"article-title\" href=\"https://www.mercurynews.com/2023/01/05/pebble-beach-pro-am-former-giants-catcher-buster-posey-to-take-part-in-tournament/\" title=\"Pebble Beach Pro-Am: Former Giants catcher Buster Posey to take part in tournament\">\n\t\n\t\t\t\t<span class=\"dfm-title metered\">\n\t\t\tPebble Beach Pro-Am: Former Giants catcher Buster Posey to take part in tournament\t\t</span>\n\n\t\t\t</a>\n\t\n</li></ul></aside>\n<p>“It was really bizarre the last four holes or so with the wind,” Spieth said. “It went from nothing to flipping and then blowing about 25 out of nowhere the other direction than the forecast. That throws us through a big loop when you’re prepping for something and you got to make the adjustment.</p>\n<p>“But I had a good last three holes and that always kind of puts a smile on your face.”</p>\n<p>He played them in 1 under, with a tough par save from a flyer lie in the rough, having no idea what the wind was going to do when his ball got in the air.</p>\n","content:encodedSnippet":"PEBBLE BEACH — Changes in weather and fortunes can happen without notice in the AT&T Pebble Beach Pro-Am, which seems to suit Hank Lebioda just fine these days.\nPlaying his sixth different course in his last six rounds on the PGA Tour, Lebioda ran off six birdies in an eight-hole stretch for an 8-under 63 on the Shore course at Monterey Peninsula and a one-shot lead after the opening round Thursday.\nHis big advantage was finishing before a pleasant day of mostly sunny, relatively calm conditions gave way to wind strong enough to bend flagsticks and force players to remove caps before they putted so they wouldn’t blow off.\nLebioda was among six players from the leading 12 scores who have yet to win on the PGA Tour. He doesn’t have a good recipe for success in tournaments with multiple courses except to be prepared for anything.\n“This would be eight courses in three weeks for us,” said Lebioda, who missed the cut in the Farmers Insurance Open at Torrey Pines and The American Express. “Three courses in Palm Springs, two last week in San Diego, and three this week. So the best thing you can do is take care of yourself, relax, and make sure you’re good to go.”\nThree of the top four scores to par were at Monterey Peninsula. Kurt Kitayama made four straight birdies around the turn and had a bogey-free 64, while Harry Hall made five straight birdies and was tied for the lead until a late bogey on No. 8. He also had 64.\n“The birdie streak on the front was pretty cool because I think I went bogey and then had a par on the second hole and then had five in a row. So it was really good,” Hall said. “Coming down the last two holes it started to blow 45 miles an hour. It was crazy. Happy to get in at 7 under today.”\nChad Ramey had a 7-under 65 at Pebble Beach. He was tied for the lead until going into the front bunker on the par-3 17th and taking bogey.\nThe best score at Spyglass Hill belonged to Keith Mitchell at 5-under 67. It was the only course where the average score was over par. Mitchell was alongside a pair of NFL quarterbacks. His amateur partner is Josh Allen of the Buffalo Bills, whose caddie for the week is Kyle Allen of the Houston Texans.\nThe change in weather was not terribly severe — it’s not like it snowed. Even so, it caused havoc among those trying to finish at Pebble Beach, the most exposed of the courses.\nWill Gordon was tied for the lead to par at 8 under with three holes to play. From the middle of the 16th fairway into a strengthening wind, he came up 35 yards short of the back pin and made bogey. Dead into the wind on the par-3 17th to a right pin — the easiest location for three days to account for amateurs — he was some 30 yards short and dropped another shot.\nHe finished with a triple bogey, driving into the ocean rocks left of the fairway and having to reload. His approach into a strong wind coming off the ocean left him behind a tree, and he hit that over the green into a bunker.\nIn three holes, he went from tied for the lead to a tie for 24th.\nThe celebrity rotation was at Spyglass Hill, regarded as the toughest of the three in calm conditions. U.S Open champion Matt Fitzpatrick and three-time major champion Jordan Spieth each managed a 71, while Viktor Hovland had a 70.\nHovland is playing the tournament for the first time, though he won the U.S. Amateur at Pebble Beach and was low amateur at Pebble in the 2019 U.S. Open.\nSpieth, who won this event in 2017, was mixture of birdies and bogeys, and then had to hang on for dear life over the final hour when temperatures plunged and the wind began whipping.\nRelated Articles\n\nGolf | \n\t\t\t\n\t\n\t\t\t\t\n\t\t\tPhotos: Prepping for the Pebble Beach Pro-Am\t\t\n\n\t\t\t\n\t\n\nGolf | \n\t\t\t\n\t\n\t\t\t\t\n\t\t\tAT&T Pebble Beach Pro-Am: 7-foot Pau Gasol joins celebrity lineup\t\t\n\n\t\t\t\n\t\n\nGolf | \n\t\t\t\n\t\n\t\t\t\t\n\t\t\tAlameda wants a mulligan on lawsuit against operators of its prestigious Bay Area golf course\t\t\n\n\t\t\t\n\t\n\nGolf | \n\t\t\t\n\t\n\t\t\t\t\n\t\t\tBill Murray will return for this year’s AT&T Pebble Beach Pro-Am\t\t\n\n\t\t\t\n\t\n\nGolf | \n\t\t\t\n\t\n\t\t\t\t\n\t\t\tPebble Beach Pro-Am: Former Giants catcher Buster Posey to take part in tournament\t\t\n\n\t\t\t\n\t\n\n\n“It was really bizarre the last four holes or so with the wind,” Spieth said. “It went from nothing to flipping and then blowing about 25 out of nowhere the other direction than the forecast. That throws us through a big loop when you’re prepping for something and you got to make the adjustment.\n“But I had a good last three holes and that always kind of puts a smile on your face.”\nHe played them in 1 under, with a tough par save from a flyer lie in the rough, having no idea what the wind was going to do when his ball got in the air.","dc:creator":"Doug Ferguson","comments":"https://www.mercurynews.com/2023/02/02/att-pebble-beach-pro-am-from-low-scores-to-bizarre-conditions-in-opening-round/#respond","content":"Round one leader Hank Lebioda had six birdies in eight-hole stretch for an 8-under 63 on the Shore course at Monterey Peninsula","contentSnippet":"Round one leader Hank Lebioda had six birdies in eight-hole stretch for an 8-under 63 on the Shore course at Monterey Peninsula","guid":"https://www.mercurynews.com/?p=9731526","categories":["Golf","Latest Headlines","Sports","Inside Sports","Morning Report News","Morning Wire","Pebble Beach Golf Tournament"],"isoDate":"2023-02-03T04:03:24.000Z"},{"creator":"Tribune News Service","title":"DeMar DeRozan is an All-Star for the 6th time in his career: ‘This is beyond exciting,’ the Chicago Bulls forward says","link":"https://www.mercurynews.com/2023/02/02/demar-derozan-is-an-all-star-for-the-6th-time-in-his-career-this-is-beyond-exciting-the-chicago-bulls-forward-says/","pubDate":"Fri, 03 Feb 2023 04:00:29 +0000","content:encoded":"<p>DeMar DeRozan was selected to the Eastern Conference All-Star team for the second straight year and will be the only Chicago Bulls representative at the Feb. 19 game in Salt Lake City.</p>\n<p>It was the sixth All-Star nod for DeRozan, who was a starter last year and joined by Zach LaVine.</p>\n<p>DeRozan said before the Bulls&#8217; 114-98 home victory against the Charlotte Hornets on Thursday that the feeling never grows old.</p>\n<p>&#8220;Man, this is beyond exciting for me, to still be playing, with all the things I&#8217;ve accomplished in my career,&#8221; he said. &#8220;I couldn&#8217;t even (have) thought of a lot of stuff that I&#8217;ve accomplished, being from Compton, Calif. Being through all the stuff I&#8217;ve been through personally, career-wise, to still be honored as an All-Star is definitely an honor.&#8221;</p>\n<p>He scored 15 points against the Hornets, one of six Bulls to finish in double digits. Ayo Dosunmu led the way with a season-high-tying 22. Alex Caruso was ruled out at the half with a right foot sprain, and Patrick Williams left late with a right ankle injury.</p>\n<p>DeRozan finished sixth in fan voting, which accounts for 50% of the weighted score, well behind starters Kyrie Irving of the Brooklyn Nets and Donovan Mitchell of the Cleveland Cavaliers.</p>\n<p>The Bulls&#8217; 23-27 record through 50 games led some to speculate they might be shut out on All-Star selections. But DeRozan&#8217;s offensive numbers were similar to last season, and his stature in the league likely factored in when NBA coaches selected reserves. He entered Thursday averaging 26.3 points, ranked 15th in the league.</p>\n<p>After making a name for himself early in his career in Toronto, DeRozan has enjoyed a renaissance in his two seasons with the Bulls. His talents were forgotten by some when the Raptors dealt him to the San Antonio Spurs, who seldom were talked about or seen on nationally televised games.</p>\n<p>It took coming to Chicago for people to pay attention again, something that wasn&#8217;t lost on DeRozan.</p>\n<p>&#8220;It (means) everything,&#8221; he said. &#8220;I just hope anybody out there, whatever field you work in, never listen to the outside noise of people doubting you, counting you out, everything. As long as you&#8217;re true to yourself, believe in yourself, if you keep putting in the work with genuine heart and genuine passion, you will be rewarded.&#8221;</p>\n<p>DeRozan quickly became the most popular player on the revamped Bulls last season, as well as the team leader. His arrival wasn&#8217;t greeted with much hype, but fans paid close attention to what he brought to the team, the blunt way he spoke and the natural leadership ability he brought to the West Side.</p>\n<p>Chicago and DeRozan were made for each other. He looked back on the trade that brought him to town as a day that changed his outlook on life.</p>\n<p>&#8220;It&#8217;s meant everything,&#8221; he said of Chicago. &#8220;It&#8217;s been a resurgence of my passion, my happiness, my joy, my hard work and everything I went through personally. It just put everything back in perspective for me, for the love of the game. And I show it every time I go out there on the court.&#8221;</p>\n<p>DeRozan was joined on the East reserve list by the Philadelphia 76ers&#8217; Joel Embiid, Boston Celtics&#8217; Jaylen Brown, Miami Heat&#8217;s Bam Adebayo, Milwaukee Bucks&#8217; Jrue Holiday, New York Knicks&#8217; Julius Randle and Indiana Pacers&#8217; Tyrese Haliburton. Former Bulls forward Lauri Markkanen was among the Western Conference reserves.</p>\n<p>Though he wished another Bulls teammate had made the game &#8212; LaVine would have been the only possibility &#8212; DeRozan was honored to be selected by coaches, the ones who know the game more than anyone.</p>\n<p>&#8220;It means a lot,&#8221; he said. &#8220;I never take anything like that lightly or for granted at all. I&#8217;m very appreciative.&#8221;</p>\n<p>Being shut out of the All-Star Game would&#8217;ve been a tough pill to swallow for an organization with three former All-Stars on the roster in DeRozan, LaVine and Nikola Vu&#269;evi&#263;. But the Bulls avoided that embarrassment.</p>\n<p>&#8220;I wouldn&#8217;t use the word embarrassing,&#8221; coach Billy Donovan said. &#8220;You always want to see your guys rewarded for their play and what they&#8217;ve done. Obviously it&#8217;s a very, very prestigious honor. There&#8217;s not many guys that get a chance to be a part of it.&#8221;</p>\n<p>DeRozan acknowledged it has been a &#8220;stressful&#8221; stretch for him as the leader and most prominent player on an inconsistent Bulls team. Trying to right the ship has been much more important to him than worrying about another All-Star nod.</p>\n<p>&#8220;Just trying to keep the team in a positive place,&#8221; he said. &#8220;That&#8217;s been my main priority, and my main concern. It wasn&#8217;t (an All-Star selection) at all. If it came, it came. Since it&#8217;s here, got to deal with it and accept it, and I appreciate it is here. But you all know my mantra. I try and go out there and win every single game.&#8221;</p>\n<p>In the end he spoke of what the game meant to him growing up in Compton, thinking it would be &#8220;impossible for me to even be in this position.&#8221; Not only did he make it, he excelled at his craft and nurtured his reputation as a player who never stopped working to improve his game.</p>\n<p>&#8220;For me it&#8217;s a dream,&#8221; he said. &#8220;I&#8217;m pretty sure tonight after we get this win I&#8217;m going to lay in bed and be in awe again, reminiscing about everything I&#8217;ve done in my career.&#8221;</p>\n<p> ()</p>\n","content:encodedSnippet":"DeMar DeRozan was selected to the Eastern Conference All-Star team for the second straight year and will be the only Chicago Bulls representative at the Feb. 19 game in Salt Lake City.\nIt was the sixth All-Star nod for DeRozan, who was a starter last year and joined by Zach LaVine.\nDeRozan said before the Bulls’ 114-98 home victory against the Charlotte Hornets on Thursday that the feeling never grows old.\n“Man, this is beyond exciting for me, to still be playing, with all the things I’ve accomplished in my career,” he said. “I couldn’t even (have) thought of a lot of stuff that I’ve accomplished, being from Compton, Calif. Being through all the stuff I’ve been through personally, career-wise, to still be honored as an All-Star is definitely an honor.”\nHe scored 15 points against the Hornets, one of six Bulls to finish in double digits. Ayo Dosunmu led the way with a season-high-tying 22. Alex Caruso was ruled out at the half with a right foot sprain, and Patrick Williams left late with a right ankle injury.\nDeRozan finished sixth in fan voting, which accounts for 50% of the weighted score, well behind starters Kyrie Irving of the Brooklyn Nets and Donovan Mitchell of the Cleveland Cavaliers.\nThe Bulls’ 23-27 record through 50 games led some to speculate they might be shut out on All-Star selections. But DeRozan’s offensive numbers were similar to last season, and his stature in the league likely factored in when NBA coaches selected reserves. He entered Thursday averaging 26.3 points, ranked 15th in the league.\nAfter making a name for himself early in his career in Toronto, DeRozan has enjoyed a renaissance in his two seasons with the Bulls. His talents were forgotten by some when the Raptors dealt him to the San Antonio Spurs, who seldom were talked about or seen on nationally televised games.\nIt took coming to Chicago for people to pay attention again, something that wasn’t lost on DeRozan.\n“It (means) everything,” he said. “I just hope anybody out there, whatever field you work in, never listen to the outside noise of people doubting you, counting you out, everything. As long as you’re true to yourself, believe in yourself, if you keep putting in the work with genuine heart and genuine passion, you will be rewarded.”\nDeRozan quickly became the most popular player on the revamped Bulls last season, as well as the team leader. His arrival wasn’t greeted with much hype, but fans paid close attention to what he brought to the team, the blunt way he spoke and the natural leadership ability he brought to the West Side.\nChicago and DeRozan were made for each other. He looked back on the trade that brought him to town as a day that changed his outlook on life.\n“It’s meant everything,” he said of Chicago. “It’s been a resurgence of my passion, my happiness, my joy, my hard work and everything I went through personally. It just put everything back in perspective for me, for the love of the game. And I show it every time I go out there on the court.”\nDeRozan was joined on the East reserve list by the Philadelphia 76ers’ Joel Embiid, Boston Celtics’ Jaylen Brown, Miami Heat’s Bam Adebayo, Milwaukee Bucks’ Jrue Holiday, New York Knicks’ Julius Randle and Indiana Pacers’ Tyrese Haliburton. Former Bulls forward Lauri Markkanen was among the Western Conference reserves.\nThough he wished another Bulls teammate had made the game — LaVine would have been the only possibility — DeRozan was honored to be selected by coaches, the ones who know the game more than anyone.\n“It means a lot,” he said. “I never take anything like that lightly or for granted at all. I’m very appreciative.”\nBeing shut out of the All-Star Game would’ve been a tough pill to swallow for an organization with three former All-Stars on the roster in DeRozan, LaVine and Nikola Vučević. But the Bulls avoided that embarrassment.\n“I wouldn’t use the word embarrassing,” coach Billy Donovan said. “You always want to see your guys rewarded for their play and what they’ve done. Obviously it’s a very, very prestigious honor. There’s not many guys that get a chance to be a part of it.”\nDeRozan acknowledged it has been a “stressful” stretch for him as the leader and most prominent player on an inconsistent Bulls team. Trying to right the ship has been much more important to him than worrying about another All-Star nod.\n“Just trying to keep the team in a positive place,” he said. “That’s been my main priority, and my main concern. It wasn’t (an All-Star selection) at all. If it came, it came. Since it’s here, got to deal with it and accept it, and I appreciate it is here. But you all know my mantra. I try and go out there and win every single game.”\nIn the end he spoke of what the game meant to him growing up in Compton, thinking it would be “impossible for me to even be in this position.” Not only did he make it, he excelled at his craft and nurtured his reputation as a player who never stopped working to improve his game.\n“For me it’s a dream,” he said. “I’m pretty sure tonight after we get this win I’m going to lay in bed and be in awe again, reminiscing about everything I’ve done in my career.”\n ()","dc:creator":"Tribune News Service","comments":"https://www.mercurynews.com/2023/02/02/demar-derozan-is-an-all-star-for-the-6th-time-in-his-career-this-is-beyond-exciting-the-chicago-bulls-forward-says/#respond","content":"DeMar DeRozan was selected to the Eastern Conference All-Star team for the second straight year and will be the only Chicago Bulls representative at the Feb. 19 game in Salt Lake City. Ayo Dosunmu led the way with a season-high-tying 22. Alex Caruso was ruled out at the half with a right foot sprain, and Patrick Williams left late with a right ankle injury.","contentSnippet":"DeMar DeRozan was selected to the Eastern Conference All-Star team for the second straight year and will be the only Chicago Bulls representative at the Feb. 19 game in Salt Lake City. Ayo Dosunmu led the way with a season-high-tying 22. Alex Caruso was ruled out at the half with a right foot sprain, and Patrick Williams left late with a right ankle injury.","guid":"https://www.mercurynews.com/2023/02/02/demar-derozan-is-an-all-star-for-the-6th-time-in-his-career-this-is-beyond-exciting-the-chicago-bulls-forward-says/","categories":["NBA","Sports"],"isoDate":"2023-02-03T04:00:29.000Z"},{"creator":"Tribune News Service","title":"Winderman’s view: Kyle Lowry invisible again for Heat, this time in loss to Knicks","link":"https://www.mercurynews.com/2023/02/02/windermans-view-kyle-lowry-invisible-again-for-heat-this-time-in-loss-to-knicks/","pubDate":"Fri, 03 Feb 2023 03:34:04 +0000","content:encoded":"<p>Observations and other notes of interest from Thursday night&#8217;s 106-104 loss to the New York Knicks:</p>\n<p>&#8211; Yes, this is redundant.</p>\n<p>&#8211; It also is reality.</p>\n<p>&#8211; Kyle Lowry played Tuesday night&#8217;s first half in Cleveland without a point, rebound or assist.</p>\n<p>&#8211; He then played Thursday&#8217;s first half without a point, rebound or assist.</p>\n<p>&#8211; This time missing all five of his first-half shots, four of them 3-point attempts.</p>\n<p>&#8211; As the Knicks also hunted him (when they weren&#8217;t hunting Tyler Herro) on defense.</p>\n<p>&#8211; Lowry was minus 20 at halftime.</p>\n<p>&#8211; At a stage the Heat trailed by three.</p>\n<p>&#8211; At halftime, the Knicks&#8217; Jalen Brunson had as many points, rebounds and assists as Lowry.</p>\n<p>&#8211; And he did not play, sidelined by illness.</p>\n<p>&#8211; Lowry&#8217;s first points, on a 3-pointer, came with 2:44 left in the third period.</p>\n<p>&#8211; After an 0-for-6 start from the field.</p>\n<p>&#8211; He exited for good with 1:41 left in the third period.</p>\n<p>&#8211; It&#8217;s a tough spot for Erik Spoelstra.</p>\n<p>&#8211; With the Heat this season already sitting Ducan Robinson&#8217;s money.</p>\n<p>&#8211; And Dewayne Dedmon&#8217;s (more on that later).</p>\n<p>&#8211; It&#8217;s almost as if Lowry is making Gabe Vincent indispensable.</p>\n<p>&#8211; With Vincent again having his moments.</p>\n<p>&#8211; The Heat again opened with Bam Adebayo, Caleb Martin, Jimmy Butler, Herro and Lowry.</p>\n<p>&#8211; With the appearance, Adebayo tied Goran Dragic for 10th on the Heat&#8217;s all-time games list.</p>\n<p>&#8211; Victor Oladipo was an active scratch, due to an ankle sprain.</p>\n<p>&#8211; With Orlando Robinson out due to a fractured thumb, Udonis Haslem played as the Heat&#8217;s first big man off the bench.</p>\n<p>&#8211; Ahead of Dedmon</p>\n<p>&#8211; Which says plenty about where Dedmon stands.</p>\n<p>&#8211; Or doesn&#8217;t.</p>\n<p>&#8211; Haslem entered in the Heat&#8217;s first substitution along with Max Strus.</p>\n<p>&#8211; Typically, that is when Oladipo would have entered.</p>\n<p>&#8211; Haywood Highsmith played as the Heat&#8217;s third reserve.</p>\n<p>&#8211; And again had his moments.</p>\n<p>&#8211; Vincent then made it nine deep.</p>\n<p>&#8211; Butler&#8217;s first steal moved him past Reggie Theus for 93rd on the NBA all-time list.</p>\n<p>&#8211; Butler tied Shaquille O&#8217;Neal for 17 on the Heat all-time list of double-digit games in points.</p>\n<p>&#8211; Herro&#8217;s second assist moved him past Josh Richardson for 17th on the Heat all-time list.</p>\n<p>&#8211; Vincent&#8217;s third 3-pointer attempt moved him past Dion Waiters for 24th on Heat all-time list.</p>\n<p>&#8211; Adebayo&#8217;s fifth free throw was the 1,300th of his career.</p>\n<p>&#8211; Spoelstra noted the uncommonness of having not faced the Heat this season until Thursday.</p>\n<p>&#8211; &#8220;There&#8217;s no doubt about it,&#8221; he said, &#8220;it&#8217;s a little bit unique that we&#8217;re this far along in the season, we haven&#8217;t even played &#8216;em yet, and we&#8217;ll play them four times in the next five weeks.&#8221;</p>\n<p>&#8211; Still, he said the legacy of Heat-Knicks endures.</p>\n<p>&#8211; &#8220;This history,&#8221; Spoelstra said, &#8220;it&#8217;s not specifically relevant now, but I think you inherit all of the things that we&#8217;ve experienced as an organization. Ultimately, it&#8217;s just good competition. We&#8217;re both right there, basically in a similar spot in the very competitive Eastern Conference.&#8221;</p>\n<p>&#8211; Of the scheduling that did not have the teams meeting this season until Thursday, Knicks coach Tom Thibodeau said, &#8220;It&#8217;s a quirk. Those things happen.&#8221;</p>\n<p>&#8211; Of this current rendition of the Knicks, Spoelstra said, &#8220;You respect how they play, how physical they are, and how much emotion and passion they play with in this environment, this building.&#8221;</p>\n<p>&#8211; Knicks guard Jalen Brunson on the Heat, &#8220;Obviously they have great personnel, a culture that they talk about all the time.&#8221;</p>\n<p>&#8211; Thibodeau said among the prime reasons the Heat entered with 17 wins in their previous 25 was the team&#8217;s return to health.</p>\n<p>&#8211; On meeting up again with Butler, his player in Chicago and Minnesota, Thibodeau said, &#8220;Jimmy&#8217;s Jimmy. He&#8217;s the ultimate competitor, and I think that transcends anything. He&#8217;s going to find a way to win.&#8221;</p>\n<p> ()</p>\n","content:encodedSnippet":"Observations and other notes of interest from Thursday night’s 106-104 loss to the New York Knicks:\n– Yes, this is redundant.\n– It also is reality.\n– Kyle Lowry played Tuesday night’s first half in Cleveland without a point, rebound or assist.\n– He then played Thursday’s first half without a point, rebound or assist.\n– This time missing all five of his first-half shots, four of them 3-point attempts.\n– As the Knicks also hunted him (when they weren’t hunting Tyler Herro) on defense.\n– Lowry was minus 20 at halftime.\n– At a stage the Heat trailed by three.\n– At halftime, the Knicks’ Jalen Brunson had as many points, rebounds and assists as Lowry.\n– And he did not play, sidelined by illness.\n– Lowry’s first points, on a 3-pointer, came with 2:44 left in the third period.\n– After an 0-for-6 start from the field.\n– He exited for good with 1:41 left in the third period.\n– It’s a tough spot for Erik Spoelstra.\n– With the Heat this season already sitting Ducan Robinson’s money.\n– And Dewayne Dedmon’s (more on that later).\n– It’s almost as if Lowry is making Gabe Vincent indispensable.\n– With Vincent again having his moments.\n– The Heat again opened with Bam Adebayo, Caleb Martin, Jimmy Butler, Herro and Lowry.\n– With the appearance, Adebayo tied Goran Dragic for 10th on the Heat’s all-time games list.\n– Victor Oladipo was an active scratch, due to an ankle sprain.\n– With Orlando Robinson out due to a fractured thumb, Udonis Haslem played as the Heat’s first big man off the bench.\n– Ahead of Dedmon\n– Which says plenty about where Dedmon stands.\n– Or doesn’t.\n– Haslem entered in the Heat’s first substitution along with Max Strus.\n– Typically, that is when Oladipo would have entered.\n– Haywood Highsmith played as the Heat’s third reserve.\n– And again had his moments.\n– Vincent then made it nine deep.\n– Butler’s first steal moved him past Reggie Theus for 93rd on the NBA all-time list.\n– Butler tied Shaquille O’Neal for 17 on the Heat all-time list of double-digit games in points.\n– Herro’s second assist moved him past Josh Richardson for 17th on the Heat all-time list.\n– Vincent’s third 3-pointer attempt moved him past Dion Waiters for 24th on Heat all-time list.\n– Adebayo’s fifth free throw was the 1,300th of his career.\n– Spoelstra noted the uncommonness of having not faced the Heat this season until Thursday.\n– “There’s no doubt about it,” he said, “it’s a little bit unique that we’re this far along in the season, we haven’t even played ‘em yet, and we’ll play them four times in the next five weeks.”\n– Still, he said the legacy of Heat-Knicks endures.\n– “This history,” Spoelstra said, “it’s not specifically relevant now, but I think you inherit all of the things that we’ve experienced as an organization. Ultimately, it’s just good competition. We’re both right there, basically in a similar spot in the very competitive Eastern Conference.”\n– Of the scheduling that did not have the teams meeting this season until Thursday, Knicks coach Tom Thibodeau said, “It’s a quirk. Those things happen.”\n– Of this current rendition of the Knicks, Spoelstra said, “You respect how they play, how physical they are, and how much emotion and passion they play with in this environment, this building.”\n– Knicks guard Jalen Brunson on the Heat, “Obviously they have great personnel, a culture that they talk about all the time.”\n– Thibodeau said among the prime reasons the Heat entered with 17 wins in their previous 25 was the team’s return to health.\n– On meeting up again with Butler, his player in Chicago and Minnesota, Thibodeau said, “Jimmy’s Jimmy. He’s the ultimate competitor, and I think that transcends anything. He’s going to find a way to win.”\n ()","dc:creator":"Tribune News Service","comments":"https://www.mercurynews.com/2023/02/02/windermans-view-kyle-lowry-invisible-again-for-heat-this-time-in-loss-to-knicks/#respond","content":"Observations and other notes of interest from Thursday night&#8217; s 106-104 loss to the New York Knicks:. &#8211;Kyle Lowry played Tuesday night&#8217; s first half in Cleveland without a point, rebound or assist. &#8211;At halftime, the Knicks&#8217; Jalen Brunson had as many points, rebounds and assists as Lowry.","contentSnippet":"Observations and other notes of interest from Thursday night’ s 106-104 loss to the New York Knicks:. –Kyle Lowry played Tuesday night’ s first half in Cleveland without a point, rebound or assist. –At halftime, the Knicks’ Jalen Brunson had as many points, rebounds and assists as Lowry.","guid":"https://www.mercurynews.com/2023/02/02/windermans-view-kyle-lowry-invisible-again-for-heat-this-time-in-loss-to-knicks/","categories":["NBA","Sports"],"isoDate":"2023-02-03T03:34:04.000Z"},{"creator":"Tribune News Service","title":"Birdland Caravan: Orioles GM Mike Elias on free agents, infield prospects, Grayson Rodriguez and more","link":"https://www.mercurynews.com/2023/02/02/birdland-caravan-orioles-gm-mike-elias-on-free-agents-infield-prospects-grayson-rodriguez-and-more/","pubDate":"Fri, 03 Feb 2023 03:19:32 +0000","content:encoded":"<p>After three years off because of the coronavirus pandemic, the Orioles kicked off their first Birdland Caravan, a replacement for FanFest, since 2020 on Thursday with a fan rally at Bel Air High School.</p>\n<p>During the question and answer segment with fans, executive vice president and general manager Mike Elias said that the Orioles are still in the market to add to their major league roster before or during spring training. So far this offseason, Elias has added starting pitchers Kyle Gibson and Cole Irvin, reliever Mychal Givens, catcher James McCann and second baseman Adam Frazier.</p>\n<p>&#8220;We&#8217;re still working on stuff. I can&#8217;t predict, and there&#8217;s not a ton of free agents left, especially premier ones,&#8221; Elias said. &#8220;It&#8217;s very possible that we sign another major league free agent before we head to camp. We also might do things during camp.&#8221;</p>\n<p>Elias and manager Brandon Hyde took several questions from fans during the kickoff event on topics ranging from the team&#8217;s top-ranked farm system to pitching prospect Grayson Rodriguez to the league&#8217;s new balanced schedule.</p>\n<p>Here are the most interesting topics Elias and Hyde discussed during Thursday&#8217;s Q&amp;A:</p>\n<h3>Infield prospects</h3>\n<p>Elias was asked about the Orioles&#8217; stockpile of middle infield prospects, and he said the team having &#8220;too many shortstops&#8221; is the &#8220;least of his worries.&#8221;</p>\n<p>&#8220;I think we&#8217;ve got three great middle infield prospects right now in Triple-A: Connor Norby, who&#8217;s primarily a second baseman; Jordan Westburg, who could play really all of the spots; and Joey Ortiz, who is a defensive wizard kind of shortstop,&#8221; Elias said. &#8220;We&#8217;re really excited about all of them. It&#8217;s a great problem to have too many shortstops or too many middle infielders.&#8221;</p>\n<p>In January, the Orioles traded from that infield depth in the farm system to acquire <a href=\"https://www.baltimoresun.com/sports/orioles/bs-sp-orioles-starting-pitcher-cole-irvin-understands-role-20230127-iaxv3xrizvafbdaglqjwin6bmu-story.html\" target=\"_blank\" rel=\"noopener\">left-handed starting pitcher Cole Irvin</a> from the Oakland Athletics in exchange for 21-year-old shortstop prospect Darell Hernaiz.</p>\n<h3>Grayson Rodriguez</h3>\n<p>Elias has said several times this offseason that he expects Rodriguez to break camp in the <a href=\"https://www.baltimoresun.com/sports/orioles/bs-sp-orioles-rotation-options-crowded-20230130-putmuv4mxbaxpgauiz2mhtz76q-story.html\" target=\"_blank\" rel=\"noopener\">Orioles&#8217; starting rotation</a>, and he reiterated that sentiment Thursday.</p>\n<p>&#8220;We can&#8217;t wait to see him in spring training,&#8221; Elias said. &#8220;&#8230; It will be really exciting for us to see him out there in Sarasota. I&#8217;m really pulling for him to be in the rotation when we break camp.&#8221;</p>\n<p>But could the team&#8217;s top pitching prospect start the Orioles&#8217; first game of the season on March 30 against the Red Sox?</p>\n<p>&#8220;Will Grayson be our opening day starter? We&#8217;ll have to wait and see,&#8221; Hyde said. &#8220;It&#8217;s nice with this year we have a lot of guys to choose from. We have some veteran guys, Dean Kremer had a nice year last year, [Kyle] Bradish has really good stuff, Tyler Wells pitched extremely well. I think we&#8217;re going to let Grayson kind of pitch in spring training, and we&#8217;re going to make the decision with what we&#8217;re going to do with him when camp breaks.&#8221;</p>\n<h3>Trevor Bauer</h3>\n<p>A fan asked Elias whether the team was considering signing starting pitcher Trevor Bauer.</p>\n<p>Bauer, who hasn&#8217;t pitched in the majors since June 2021, is a free agent after being reinstated by the league&#8217;s independent arbitrator this offseason. The 32-year-old right-hander was put on administrative leave for the last half of the 2021 season and then suspended for all of 2022 for violating the league&#8217;s domestic violence and sexual assault policy after a San Diego woman accused him of sexually abusing her. Bauer has denied the allegation.</p>\n<p>&#8220;You know, I&#8217;m actually not able to answer that,&#8221; Elias said. &#8220;It&#8217;s against major league rules to talk about whether or not we&#8217;re interested in any free agent, and he&#8217;s no different. So I can&#8217;t answer.&#8221;</p>\n<h3>Balanced schedule</h3>\n<p>The Orioles will play fewer games against American League East opponents in 2023 thanks to the league&#8217;s new balanced schedule. All 30 teams will play each other this season, meaning the Orioles will play only 52 games against the Yankees, Red Sox, Blue Jays and Rays instead of the 76 times they played those teams in previous seasons.</p>\n<p>Does Hyde like the change?</p>\n<p>&#8220;I think we&#8217;re excited to have that balanced schedule,&#8221; Hyde said. &#8220;Our division is extremely challenging, four really good other clubs that are extremely talented. But to be able to play everybody, I&#8217;m really looking forward to that. To be able to see everybody, I think it&#8217;s going to be valuable for fans as well as for us.&#8221;</p>\n<p> ()</p>\n","content:encodedSnippet":"After three years off because of the coronavirus pandemic, the Orioles kicked off their first Birdland Caravan, a replacement for FanFest, since 2020 on Thursday with a fan rally at Bel Air High School.\nDuring the question and answer segment with fans, executive vice president and general manager Mike Elias said that the Orioles are still in the market to add to their major league roster before or during spring training. So far this offseason, Elias has added starting pitchers Kyle Gibson and Cole Irvin, reliever Mychal Givens, catcher James McCann and second baseman Adam Frazier.\n“We’re still working on stuff. I can’t predict, and there’s not a ton of free agents left, especially premier ones,” Elias said. “It’s very possible that we sign another major league free agent before we head to camp. We also might do things during camp.”\nElias and manager Brandon Hyde took several questions from fans during the kickoff event on topics ranging from the team’s top-ranked farm system to pitching prospect Grayson Rodriguez to the league’s new balanced schedule.\nHere are the most interesting topics Elias and Hyde discussed during Thursday’s Q&A:\nInfield prospects\nElias was asked about the Orioles’ stockpile of middle infield prospects, and he said the team having “too many shortstops” is the “least of his worries.”\n“I think we’ve got three great middle infield prospects right now in Triple-A: Connor Norby, who’s primarily a second baseman; Jordan Westburg, who could play really all of the spots; and Joey Ortiz, who is a defensive wizard kind of shortstop,” Elias said. “We’re really excited about all of them. It’s a great problem to have too many shortstops or too many middle infielders.”\nIn January, the Orioles traded from that infield depth in the farm system to acquire left-handed starting pitcher Cole Irvin from the Oakland Athletics in exchange for 21-year-old shortstop prospect Darell Hernaiz.\nGrayson Rodriguez\nElias has said several times this offseason that he expects Rodriguez to break camp in the Orioles’ starting rotation, and he reiterated that sentiment Thursday.\n“We can’t wait to see him in spring training,” Elias said. “… It will be really exciting for us to see him out there in Sarasota. I’m really pulling for him to be in the rotation when we break camp.”\nBut could the team’s top pitching prospect start the Orioles’ first game of the season on March 30 against the Red Sox?\n“Will Grayson be our opening day starter? We’ll have to wait and see,” Hyde said. “It’s nice with this year we have a lot of guys to choose from. We have some veteran guys, Dean Kremer had a nice year last year, [Kyle] Bradish has really good stuff, Tyler Wells pitched extremely well. I think we’re going to let Grayson kind of pitch in spring training, and we’re going to make the decision with what we’re going to do with him when camp breaks.”\nTrevor Bauer\nA fan asked Elias whether the team was considering signing starting pitcher Trevor Bauer.\nBauer, who hasn’t pitched in the majors since June 2021, is a free agent after being reinstated by the league’s independent arbitrator this offseason. The 32-year-old right-hander was put on administrative leave for the last half of the 2021 season and then suspended for all of 2022 for violating the league’s domestic violence and sexual assault policy after a San Diego woman accused him of sexually abusing her. Bauer has denied the allegation.\n“You know, I’m actually not able to answer that,” Elias said. “It’s against major league rules to talk about whether or not we’re interested in any free agent, and he’s no different. So I can’t answer.”\nBalanced schedule\nThe Orioles will play fewer games against American League East opponents in 2023 thanks to the league’s new balanced schedule. All 30 teams will play each other this season, meaning the Orioles will play only 52 games against the Yankees, Red Sox, Blue Jays and Rays instead of the 76 times they played those teams in previous seasons.\nDoes Hyde like the change?\n“I think we’re excited to have that balanced schedule,” Hyde said. “Our division is extremely challenging, four really good other clubs that are extremely talented. But to be able to play everybody, I’m really looking forward to that. To be able to see everybody, I think it’s going to be valuable for fans as well as for us.”\n ()","dc:creator":"Tribune News Service","comments":"https://www.mercurynews.com/2023/02/02/birdland-caravan-orioles-gm-mike-elias-on-free-agents-infield-prospects-grayson-rodriguez-and-more/#respond","content":"After three years off because of the coronavirus pandemic, the Orioles kicked off their first Birdland Caravan, a replacement for FanFest, since 2020 on Thursday with a fan rally at Bel Air High School. During the question and answer segment with fans, executive vice president and general manager Mike Elias said that the Orioles are still in the market to add to...","contentSnippet":"After three years off because of the coronavirus pandemic, the Orioles kicked off their first Birdland Caravan, a replacement for FanFest, since 2020 on Thursday with a fan rally at Bel Air High School. During the question and answer segment with fans, executive vice president and general manager Mike Elias said that the Orioles are still in the market to add to...","guid":"https://www.mercurynews.com/2023/02/02/birdland-caravan-orioles-gm-mike-elias-on-free-agents-infield-prospects-grayson-rodriguez-and-more/","categories":["MLB","Sports"],"isoDate":"2023-02-03T03:19:32.000Z"},{"creator":"Tribune News Service","title":"LaVar Ball emphasizes patience in son’s recovery: ‘Lonzo is going to be fine,’ he says of the Chicago Bulls guard","link":"https://www.mercurynews.com/2023/02/02/lavar-ball-emphasizes-patience-in-sons-recovery-lonzo-is-going-to-be-fine-he-says-of-the-chicago-bulls-guard/","pubDate":"Fri, 03 Feb 2023 02:59:39 +0000","content:encoded":"<p>LaVar Ball isn&#8217;t always a source of tranquility. But when it comes to the recovery of one of his sons &#8212; Chicago Bulls point guard Lonzo Ball &#8212; he&#8217;s focused on staying calm.</p>\n<p>Lonzo hasn&#8217;t played basketball in more than a year after suffering a meniscus injury in his left knee in January 2022. In the 13 months since, Ball has undergone two surgeries, but his recovery continues to stall out because of consistent pain and discomfort.</p>\n<p>If he can&#8217;t make significant progress before the All-Star break in two weeks, the Bulls front office will have a serious conversation about shutting him down for the second straight season. But LaVar emphasized his faith in his son&#8217;s ability to bounce back from the mysterious injury.</p>\n<p>&#8220;Lonzo is going to be fine,&#8221; Ball said during an interview with the &#8220;Gimme the Hot Sauce&#8221; podcast hosted by Bulls TV analyst Stacey King and WLS-Ch. 7 anchor Mark Schanowski. &#8220;He&#8217;s only 25 years old. He&#8217;s going to get his stuff together and then he&#8217;ll be ready to play and do his thing again. People just got to stay off that and thinking &#8216;Oh, you&#8217;re going to come back tomorrow, or next week, or next month.&#8217; &#8221;</p>\n<p>The source of Lonzo&#8217;s injury has been a mystery to the Bulls medical staff, his personal physicians and Lonzo himself. According to coach Billy Donovan, Lonzo has not been pain-free since the injury occurred.</p>\n<p>LaVar Ball attempted to provide some insight into his son&#8217;s injury, saying the main issue stemmed from &#8220;debris in a nerve&#8221; in his knee. But he didn&#8217;t specify which nerve or whether that was the source of the continued pain that Lonzo has felt even after undergoing a second arthroscopic procedure in September.</p>\n<p>&#8220;That&#8217;s why he couldn&#8217;t get nothing done,&#8221; Ball said. &#8220;It don&#8217;t allow you to stretch like that. But all that&#8217;s done now. So now it&#8217;s about getting your strength back and then getting your endurance.&#8221;</p>\n<p>Ball reiterated the same message the Bulls have stuck to with Lonzo &#8212; patience.</p>\n<p>&#8220;Like I told him, do everything slow,&#8221; Ball said. &#8220;Don&#8217;t be 70% and try to come out there. Be 100%. So whenever you&#8217;re 100% come back and be ready to go. It ain&#8217;t about sitting out one game, 20 games (or) worrying about the money and stuff like that. Just make sure you&#8217;re healthy and good to go where you can play the same way.&#8221;</p>\n<p> ()</p>\n","content:encodedSnippet":"LaVar Ball isn’t always a source of tranquility. But when it comes to the recovery of one of his sons — Chicago Bulls point guard Lonzo Ball — he’s focused on staying calm.\nLonzo hasn’t played basketball in more than a year after suffering a meniscus injury in his left knee in January 2022. In the 13 months since, Ball has undergone two surgeries, but his recovery continues to stall out because of consistent pain and discomfort.\nIf he can’t make significant progress before the All-Star break in two weeks, the Bulls front office will have a serious conversation about shutting him down for the second straight season. But LaVar emphasized his faith in his son’s ability to bounce back from the mysterious injury.\n“Lonzo is going to be fine,” Ball said during an interview with the “Gimme the Hot Sauce” podcast hosted by Bulls TV analyst Stacey King and WLS-Ch. 7 anchor Mark Schanowski. “He’s only 25 years old. He’s going to get his stuff together and then he’ll be ready to play and do his thing again. People just got to stay off that and thinking ‘Oh, you’re going to come back tomorrow, or next week, or next month.’ ”\nThe source of Lonzo’s injury has been a mystery to the Bulls medical staff, his personal physicians and Lonzo himself. According to coach Billy Donovan, Lonzo has not been pain-free since the injury occurred.\nLaVar Ball attempted to provide some insight into his son’s injury, saying the main issue stemmed from “debris in a nerve” in his knee. But he didn’t specify which nerve or whether that was the source of the continued pain that Lonzo has felt even after undergoing a second arthroscopic procedure in September.\n“That’s why he couldn’t get nothing done,” Ball said. “It don’t allow you to stretch like that. But all that’s done now. So now it’s about getting your strength back and then getting your endurance.”\nBall reiterated the same message the Bulls have stuck to with Lonzo — patience.\n“Like I told him, do everything slow,” Ball said. “Don’t be 70% and try to come out there. Be 100%. So whenever you’re 100% come back and be ready to go. It ain’t about sitting out one game, 20 games (or) worrying about the money and stuff like that. Just make sure you’re healthy and good to go where you can play the same way.”\n ()","dc:creator":"Tribune News Service","comments":"https://www.mercurynews.com/2023/02/02/lavar-ball-emphasizes-patience-in-sons-recovery-lonzo-is-going-to-be-fine-he-says-of-the-chicago-bulls-guard/#respond","content":"LaVar Ball isn&#8217; t always a source of tranquility. But when it comes to the recovery of one of his sons&#8212; Chicago Bulls point guard Lonzo Ball&#8212; he&#8217; s focused on staying calm. &#8220;Lonzo is going to be fine,&#8221; Ball said during an interview with the&#8220; Gimme the Hot Sauce&#8221; podcast hosted by Bulls TV analyst Stacey King and WLS-Ch. 7 anchor Mark Schanowski.&#8220; He&#8217; s only 25 years old.","contentSnippet":"LaVar Ball isn’ t always a source of tranquility. But when it comes to the recovery of one of his sons— Chicago Bulls point guard Lonzo Ball— he’ s focused on staying calm. “Lonzo is going to be fine,” Ball said during an interview with the“ Gimme the Hot Sauce” podcast hosted by Bulls TV analyst Stacey King and WLS-Ch. 7 anchor Mark Schanowski.“ He’ s only 25 years old.","guid":"https://www.mercurynews.com/2023/02/02/lavar-ball-emphasizes-patience-in-sons-recovery-lonzo-is-going-to-be-fine-he-says-of-the-chicago-bulls-guard/","categories":["NBA","Sports"],"isoDate":"2023-02-03T02:59:39.000Z"}]