[{"Topic":"Ability","Quote":"Better be proficient in one art than a smatter in a hundred.","Author":"Japanese proverb"},{"Topic":"Absence","Quote":"The absent are never without fault. Nor the present without excuse.","Author":"Benjamin Franklin"},{"Topic":"Absence","Quote":"Out of sight, out of mind.","Author":"Homer"},{"Topic":"Action","Quote":"Deliberate with caution, but act with decision; and yield with graciousness, or oppose with firmness.","Author":"Charles Caleb Colton"},{"Topic":"Action","Quote":"The great end of life is not knowledge, but action.","Author":"T. H. Huxley"},{"Topic":"Action","Quote":"Actions speak louder than words.","Author":"Proverb"},{"Topic":"Action","Quote":"We would often be ashamed of our finest actions if the world understood all the motives which produced them.","Author":"Francois de la Rochefoucauld"},{"Topic":"Action","Quote":"Things won are done, joy's soul lies in the doing.","Author":"Shakespeare"},{"Topic":"Action","Quote":"A rolling stone can gather no moss.","Author":"Pubilius Syrus"},{"Topic":"Ambition","Quote":"It is attempting to reach the top at a single leap, that so much misery is caused in the world.","Author":"William Cobbett"},{"Topic":"Ambition","Quote":"Ambition and  suspicion always go together.","Author":"Georg Christoph Lichtenberg"},{"Topic":"Ambition","Quote":"Most people would succeed in small things if they were not troubled by great ambitions.","Author":"Henry Wadsworth Longfellow"},{"Topic":"Ambition","Quote":"Ambition is a vice, but it may be the father of virtue.","Author":"Quintilian"},{"Topic":"Ambition","Quote":"The very substance of the ambitious is merely the shadow of a dream.","Author":"Shakespeare"},{"Topic":"Adversity","Quote":"The virtue of prosperity is temperance; the virtue of adversity is fortitude.","Author":"Francis Bacon"},{"Topic":"Adversity","Quote":"Adversity is the first path to truth.","Author":"George Gordon, Lord Byron"},{"Topic":"Adversity","Quote":"Trial is the true test of mortal men.","Author":"Pindar"},{"Topic":"Adversity","Quote":"Of one ill comes many.","Author":"Scottish proverb"},{"Topic":"Adversity","Quote":"Sweet are the uses of adversity, which like the toad, ugle and venomous, wears yet a precious jewel in his head.","Author":"Shakespeare"},{"Topic":"Anger","Quote":"Anger begins with folly and ends with repentance.","Author":"Henry George Bohn, Pythagoras"},{"Topic":"Anger","Quote":"Truly to moderate your mind and speech when you are angry, or else to hold your peace, betokens no ordinary nature.","Author":"Cicero"},{"Topic":"Anger","Quote":"Beware the fury of a patient man.","Author":"John Dryden"},{"Topic":"Anger","Quote":"The best answer to anger is silence.","Author":"German proverb"},{"Topic":"Anger","Quote":"A soft answer turneth away wrath; but the grievous words stir up anger.","Author":"Proverbs 15:1"},{"Topic":"Anger","Quote":"He best keeps from anger who remembers that God is always looking upon him.","Author":"Plato"},{"Topic":"Animals","Quote":"There's something wrong, or missing, with any person who hasn't  got a soft spot in their heart for an animal of some kind.","Author":"Will James"},{"Topic":"Art","Quote":"In life beauty perishes, but not in art.","Author":"Leonardo da Vinci"},{"Topic":"Life","Quote":"A baby is God's opinion that life should go on.","Author":"Carl Sandburg"},{"Topic":"Life","Quote":"Life is as tedious as a twice-told tale, vexing the ear of a dr0wsy man.","Author":"Shakespeare"},{"Topic":"Life","Quote":"One man in his time plays many parts, his acts being seven ages.","Author":"Shakespeare"},{"Topic":"Life","Quote":"The mass of men lead lives of quiet desperation.","Author":"Henry David Thoreau"},{"Topic":"Living","Quote":"Only those are fit to live who do not fear to die; and none are fit to die who have shrunk from the joy of life and the duty of life. Both life and death are parts of the same great adventure.","Author":"Theodore Roosevelt"},{"Topic":"Socialism","Quote":"Socialism is a philosophy of failure, the creed of ignorance, and the gospel of envy, its inherent virtue is the equal sharing of misery. ","Author":"Winston Churchill"},{"Topic":"Government","Quote":"You cannot legislate the poor into prosperity, by legislating the wealth out of prosperity. ","Author":"Unknown"},{"Topic":"Government","Quote":"What one person receives without working for, another person must work for without receiving.","Author":"Unknown"},{"Topic":"Government","Quote":"The government cannot give to anybody anything that the government does not first take from somebody else. ","Author":"Unknown"},{"Topic":"Government","Quote":"When half of the people get the idea that they do not have to work because the other half is going to take care of them; and when the other half gets the idea that it does no good to work, because somebody else is going to get what they work for, that is the beginning of the end of any nation. ","Author":"Unknown"},{"Topic":"Government","Quote":"The more I hear people screaming \"Freedom, freedom, freedom!,\" the more I hear their chains rattling.","Author":"George Orwell"},{"Topic":"Work","Quote":"I find that the harder I work the more luck I seem to have.","Author":"Unknown"},{"Topic":"Progress","Quote":"Each problem that I solved became a rule which served afterwards to solve other problems.","Author":"Unknown"},{"Topic":"Learning","Quote":"Try to learn something about everything and everything about something.","Author":"Unknown"},{"Topic":"Advice","Quote":"Never give advice in a crowd.","Author":"Arabian proverb"},{"Topic":"Advice","Quote":"The worst men often give the best advice.","Author":"Philip James Bailey"},{"Topic":"Advice","Quote":"A fool sometimes gives weighty advice.","Author":"Nicholas Boileau"},{"Topic":"Advice","Quote":"No one can give you better advice than yourself.","Author":"Cicero"},{"Topic":"Advice","Quote":"We ask advice, but we mean approbation.","Author":"Charles Caleb Colton"},{"Topic":"Advice","Quote":"Don't give your advice before you are called upon.","Author":"Desiderius Erasmus"},{"Topic":"Advice","Quote":"Whatever advice you give, be short.","Author":"Horace"},{"Topic":"Advice","Quote":"Advice is seldom welcome. Those who need it most, like it least.","Author":"Samuel Johnson"},{"Topic":"Advice","Quote":"When Thales was asked what was difficult, he said, \"To know one's self.\" And what was easy. \"To advise another.\"","Author":"Diogenes Laertius"},{"Topic":"Advice","Quote":"Many receive advice, only the wise profit from it.","Author":"Publilius Syrus"},{"Topic":"Advice","Quote":"The only thing to do with good advice is to pass it on. It is never of any use to oneself.","Author":"Oscar Wilde"},{"Topic":"Age","Quote":"Age appears to be the best in four things - old wood best to burn, old wine to drink, old friends to trust, and old authors to read.","Author":"Francis Bacon"},{"Topic":"Age","Quote":"Yet somehow our society must make it right and possible for old people not to fear the young or be deserted by them, for the test of a civilization is in the way that it cares for its helpless members.","Author":"Pearl S. Buck"},{"Topic":"Age","Quote":"Young men think old men are fools; but old men know young men are fools.","Author":"George Chapman"},{"Topic":"Age","Quote":"A man is as old as he's feeling.","Author":"Unknown"},{"Topic":"Age","Quote":"Age does not depend upon years, but upon temperament and health. Some men are born old, and some never grow up.","Author":"Tryon Edwards"},{"Topic":"Age","Quote":"He who is of a calm and happy nature will hardly feel the pressure of age, but to him who is of an opposite disposition, youth and age are equally a burden.","Author":"Plato"},{"Topic":"Agriculture","Quote":"For all gainful professions, nothing is better, nothing more pleasing, nothing more delightful, nothing better becomes a well-bred man than agriculture.","Author":"Cicero"},{"Topic":"Alcohol","Quote":"At the third cup, wine drinks the man.","Author":"Hokekyou Sho"},{"Topic":"America","Quote":"America has believed that in differentiation, not in uniformity, lies the path of progress. It acted on this belief; it has advanced human happiness, and it has prospered.","Author":"Louis Brandeis"},{"Topic":"Beauty","Quote":"An appearance of delicacy, and even of fragility, is almost essential to beauty.","Author":"Edmund Burke"},{"Topic":"Beauty","Quote":"Beauty provoketh thieves sooner than gold.","Author":"Shakespeare"},{"Topic":"Laughter","Quote":"You grow up the day you have the first real laugh - at yourself.","Author":"Ethel Berrymore"},{"Topic":"Laughter","Quote":"As the crackling of thorns under a pot, so is the laughter of a fool.","Author":"Ecclesiastes 7:6"},{"Topic":"Laughter","Quote":"The loud laugh that spoke the vacant mind.","Author":"Oliver Goldsmith"},{"Topic":"Laughter","Quote":"I laugh because I must not cry.","Author":"Abraham Lincoln"},{"Topic":"Laughter","Quote":"Woe unto you that laugh now! For ye shall mourn and weep.","Author":"Luke 6:25"},{"Topic":"Laughter","Quote":"Everything gives cause for either laughter or tears.","Author":"Seneca"},{"Topic":"Laughter","Quote":"The pleasantest laughter is at the expense of our enemies.","Author":"Sophocles"},{"Topic":"Laughter","Quote":"Laughter is not a bad beginning for a friendship, and it is the best ending for one.","Author":"Oscar Wilde"},{"Topic":"Leadership","Quote":"I light my candle from their torches.","Author":"Robert Burton"},{"Topic":"Leadership","Quote":"There go the people. I must follow them, for I am their leader.","Author":"Alexandre Ledru-Rollin"},{"Topic":"Leadership","Quote":"The final test of a leader is that he leaves behind him in other men the conviction and the will to carry on.","Author":"Walter Lippmann"},{"Topic":"Leadership","Quote":"You cannot be a leader and ask other people to follow you, unless you know how to follow too.","Author":"Sam Rayburn"},{"Topic":"Law","Quote":"A government of laws and not of men.","Author":"John Adams"},{"Topic":"Law","Quote":"Law is a pledge that the citizens of a state will do justice to one another.","Author":"Aristotle"},{"Topic":"Law","Quote":"Any law that takes hold of a man's daily life cannot prevail in a community unless the vast majority of the community are actively in favor of it. The laws that are the most operative are the laws which protect life.","Author":"Henry Ward Beecher"},{"Topic":"Law","Quote":"He that keepeth the law of the Lord getteth the understanding thereof: and the perfection of the fear of the Lord is wisdom.","Author":"Ecclesiastes 21:11"},{"Topic":"Law","Quote":"Law is the embodiment of the moral sentiment of the people.","Author":"William Blackstone"},{"Topic":"Law","Quote":"It cannot be helped, it is as it should be, that the law is behind the times.","Author":"Oliver Wendell Holmes"},{"Topic":"Law","Quote":"Compassion to an offender who has grossly violated the laws, is, in effect, a cruelty to the peaceable subject who has observed them.","Author":"Junius"},{"Topic":"Law","Quote":"Ye shall have one manner of law, as well for the stranger, as for one of your own country.","Author":"Leviticus 24:22"},{"Topic":"Law","Quote":"The purpose of law is to prevent the strong from always having their way.","Author":"Ovid"},{"Topic":"Law","Quote":"No man is above the law and no man is below it; nor do we ask any man's permission when we require him to obey it.","Author":"Theodore Roosevelt"},{"Topic":"Fault","Quote":"A fault confessed is more than half amended.","Author":"John Harington"},{"Topic":"Fault","Quote":"If we had no faults, we should not take so much pleasure in remarking them in others.","Author":"Francois de la Rochefoucauld"},{"Topic":"Fear","Quote":"No one loves the man whom he fears.","Author":"Aristotle"},{"Topic":"Fear","Quote":"No passion so effectually robs the mind of all its powers of acting and reasoning as fear.","Author":"Edmund Burke"},{"Topic":"Fear","Quote":"There is a courageous wisdom; there is also a false, reptile prudence, the result not of caution but of fear.","Author":"Edmund Burke"},{"Topic":"Fear","Quote":"Fear always springs from ignorance.","Author":"Ralph Waldo Emerson"},{"Topic":"Fear","Quote":"Fear is the parent of cruelty.","Author":"James Anthony Froude"},{"Topic":"Fear","Quote":"Let us never negotiate out of fear. But let us never fear to negotiate.","Author":"John F. Kennedy"},{"Topic":"Fear","Quote":"Fear is a feeling that is stronger than love.","Author":"Pliny the Younger"},{"Topic":"Fear","Quote":"Let me assert my firm belief that the only thing we have to fear is fear itself; nameless, unreasoning, unjustified terror which paralyzes needed efforts to convert retreat into advance.","Author":"Franklin D. Roosevelt"},{"Topic":"Fear","Quote":"His flight was madness; when our actions do not, our fears do make us traitors.","Author":"Shakespeare"},{"Topic":"Fear","Quote":"To him who is in fear everything rustles.","Author":"Sophocles"},{"Topic":"Fear","Quote":"Nothing is so much to be feared as fear.","Author":"Henry David Thoreau"},{"Topic":"Belief","Quote":"Who leads us is less important than what leads us - what convictions, what ocurage, what faith - win or lose.","Author":"Adlai E. Stevenson"},{"Topic":"Belief","Quote":"Unless we stand for something, we shall fall for anything.","Author":"Peter Marshall"},{"Topic":"Best","Quote":"I am as bad as the worst but, thank God, I am as good as the best.","Author":"Walt Whitman"},{"Topic":"Betrayal","Quote":"On this tenth day of June, 1940, the hand that held the dagger has struck it into the back of its neighbor.","Author":"Franklin D. Roosevelt"},{"Topic":"Blood","Quote":"I have nothing to offer but blood, toil, tears, and sweat.","Author":"Winston Churchill"},{"Topic":"Books","Quote":"The man who does not read good books has no advantage over the man who can't read them.","Author":"Mark Twain"},{"Topic":"Books","Quote":"All good books are alike in that they are truer than if they had really happened and after you are finished reading one you will feel that all that happened to you and afterwards it all belongs to you; the good and the bad, the ecstasy, the remorse and the sorrow, the people and the places and how the weather was.","Author":"Ernest Hemingway"},{"Topic":"Censorship","Quote":"Only the suppressed word is dangerous.","Author":"Ludwig Borne"},{"Topic":"Censorship","Quote":"Censorship reflects a society's lack of confidence in itself. It is a hallmark of an authoritarian regime.","Author":"Potter Stewart"},{"Topic":"Chance","Quote":"Great things spring from casualties.","Author":"Disraeli"},{"Topic":"Chance","Quote":"Chance favors only those minds which are prepared.","Author":"Louis Pasteur"},{"Topic":"Chance","Quote":"Chance is a word void of sense; nothing can exist without a cause.","Author":"Voltaire"},{"Topic":"Change","Quote":"Change is an easy panacea. It takes character to stay in one place and be happy there.","Author":"Elizabeth Clarke Dunn"},{"Topic":"Change","Quote":"There is no sin punished more implacably by nature than the sin of resistance to change.","Author":"Anne Morrow Lindbergh"},{"Topic":"Change","Quote":"Everything changes continually. What is history, indeed, but a record of change. And if there had been very few changes in the past, there would have been little of history to write.","Author":"Jawaharlal Nehru"}]